#version: 0.2
Ġ Ġ
č Ċ
ĠĠ ĠĠ
e n
ĉ ĉ
en t
Ġ !
e r
c o
u t
o n
i t
r e
o c
ĠĠĠĠ ĠĠ
Ġ i
t e
y y
l oc
a l
0 0
r o
it y
Ġ m
ent ity
d e
ĠĠ Ġ
Ġ c
m p
l i
p ut
i n
e x
loc al
local entity
Ġ +
e c
Ġ s
r i
Ġ {
t r
a t
Ġ ex
. .
u b
Ġ =
o ut
c h
Ġ+ -
i d
ĉĉ ĉ
a s
co de
co mp
on ent
comp onent
Ġi yy
v er
Ġ v
out put
e t
p ub
li c
pub lic
i on
) ;
Ġ 1
0 1
Ġ p
00 1
er ro
erro r
a n
t o
o b
ec t
s t
ob j
Ġ to
s c
Ġ loc
00 2
e w
0 2
a r
c e
u r
a in
te x
tr ain
ĉĉ ĉĉ
t ur
re tur
tex t
retur n
Ġi n
ar ent
o id
o ver
ri de
Ġex p
.. .
Ġv oid
obj ect
over ride
u p
Ġ 2
a te
Ġ (
q u
g e
Ġ d
te d
0 7
Ġ+- -
Ġc yy
li st
on t
ch an
chan ge
Ġs et
Ġ+- >
c ted
te cted
ro tected
at ion
code s
e d
o r
s er
Ġ n
i l
p t
Ġ1 5
a ut
d b
output s
aut h
er y
qu ery
p rotected
Ġc t
o ri
auth ori
authori z
Ġi mp
g ro
ĉĉ čĊ
gro up
Ġ w
o l
Ġd ont
authoriz ation
( );
en d
i yy
co n
at tr
i al
l as
put s
las s
g en
i z
co ol
Ġn ew
iz e
cool gen
Ġ 4
ut e
ec ute
it ial
itial ize
Ġp arent
i f
Ġv i
01 1
u n
Ġ "
Ġs t
0 5
co re
coolgen core
02 3
Ġst ate
f er
m ent
Ġ outputs
en ce
re fer
Ġi sc
Ġvi ew
ment s
refer ence
2 023
r oc
u re
Ġ 07
re as
Ġc lass
Ġp roc
Ġin puts
Ġ+-- -
ed ure
Ġstate ments
reas on
Ġproc edure
s e
t end
Ġex ecute
Ġex tend
Ġin itialize
Ġct coolgencore
Ġextend s
f o
ĉ čĊ
k e
m e
o v
as e
ser ver
ke y
ov e
p arent
re a
or t
r d
co rd
re cord
ĠĠĠĠĠĠ Ġ
Ġw h
00 3
Ġ+ >
pt ion
g et
ri pt
at a
ub sc
ubsc ript
d ata
ĠĠĠĠ ĠĠĠĠ
ec k
put entity
in putentity
con text
c t
l l
Ġ 3
ch eck
Ġ o
u ser
] ;
1 1
c ase
f il
t er
ĉĉ ĉĉĉ
in fo
Ġ2 7
fil ter
co m
Ġo f
( )
f a
o t
ĉĉĉĉ čĊ
or k
Ġw ork
p key
Ġ <
an d
ce s
ro ll
s et
u l
Ġ return
il d
Ġct db
0 8
b rea
Ġ group
yy y
ĉĉĉ čĊ
authorization check
08 1
brea k
Ġm ove
m and
com mand
m ove
o ption
Ġ 5
00 4
un t
b er
d ate
m ber
Ġ4 6
me mber
a m
d ont
e l
n ect
o unt
Ġ de
entity query
Ġd yyy
db con
Ġwh en
ct db
fa il
am ount
nect ion
dbcon nection
i mp
s ubscript
Ġc h
Ġs ubscript
up date
rea d
" ,
un d
fo und
move member
el se
1 0
c re
f ro
user id
Ġch ild
cre ate
fro m
c ces
f ul
n ot
p e
s ful
u cces
ex ce
Ġ1 8
Ġ4 5
ort s
fail ed
ucces sful
exce ption
i ch
Ġ query
Ġ from
in g
db error
Ġwh ich
Ġctdb query
i me
p a
s i
Ġ entity
Ġp key
Ġ2 9
m s
Ġ 9
tr ing
Ġ2 8
ms g
4 1
a mp
p er
t y
t ime
as c
ver ity
st amp
02 1
set subscript
ty pe
) )
c roll
e qu
00 6
Ġc at
Ġs croll
sc roll
ĉĉĉĉ ĉĉ
Ġ4 9
ĠĠĠĠĠĠĠĠ ĠĠĠĠ
equ al
Ġcat ch
( "
a x
g er
i sc
s ort
t al
u e
u m
v al
te ger
Ġc ase
in st
in teger
Ġs ort
tr an
01 2
an ce
Ġ2 1
Ġcyy y
pa ces
time stamp
inst ance
a me
c lass
h er
n ame
s tring
w it
Ġ reason
ĉĉ Ġ
in it
in puts
tr y
get name
() );
set dbconnection
Ġctdb entityquery
ctdb entityquery
ctdb exception
ĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠ
tran s
wit ch
" :
- -
0 9
3 1
4 0
a d
i m
o per
u se
u ll
Ġ else
Ġ userid
Ġ use
00 5
ex ecute
ar ch
Ġexp orts
authoriz ed
ol ation
un authorized
se arch
ĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠ
11 10
fa ul
ad d
oper ation
faul t
c g
s uccessful
s witch
de fault
in itialize
Ġs uccessful
ch ild
error code
ĉĉĉĉ ĉĉčĊ
get errorcode
" ))
= >
a ge
d i
d it
e verity
l b
m it
o k
p li
s up
Ġ com
ĠĠĠĠ ĠĠĠĠĠĠ
re d
Ġ+ =>
Ġs paces
Ġs everity
Ġ2 6
Ġimp orts
con dit
Ġ3 0
ot her
Ġde si
012 1
add condit
mit ted
pli ed
sup plied
Ġdesi red
addcondit ion
" ;
= ",
c k
g l
g n
i st
o re
s end
Ġ -
Ġ >
Ġ }
Ġ public
ĠĠĠĠ Ġ
al read
Ġs end
ob al
Ġ2 3
coolgen gl
get subscript
() )
Ġ5 0
si gn
equal sign
ore case
alread y
coolgengl obal
equalsign orecase
2 0
5 1
c parent
c instance
f et
i er
m ax
n ull
Ġ reference
ent if
er e
er ver
re ct
Ġm ax
Ġc parent
Ġc instance
in val
ex p
Ġs erver
ch entity
id entif
Ġp rotected
Ġp search
to tal
Ġto tal
02 11
Ġ2 2
or ity
Ġn ot
auth ority
se verity
Ġwh ere
get max
11 20
ĉĉĉĉĉ ĠĠĠĠĠĠĠ
Ġ< =
equal s
val ue
im um
di rect
fet chentity
ier s
inval id
identif iers
getmax imum
direct ion
c yyy
l y
Ġ g
Ġ čĊ
Ġ on
Ġ context
Ġi s
Ġ= =
st at
ial ect
Ġ4 0
ct coolgenglobal
Ġ3 1
Ġ5 3
ist s
Ġon ly
1 5
1 01
b ase
c d
f ull
h il
i qu
i olation
l ect
n um
p search
p other
s s
s paces
t x
u s
v iolation
w hil
Ġ 0
Ġ b
Ġ found
Ġ type
er mitted
loc ate
al ue
00 7
00 8
00 9
de s
Ġs tring
Ġv alue
Ġ1 1
Ġ1 6
Ġ1 7
Ġ1 01
01 0
01 31
01 51
Ġp other
Ġp ermitted
Ġ2 4
Ġ2 5
group ent
group entity
Ġ4 7
Ġvi olation
un iqu
Ġ" =",
se lect
get groupentity
ĠĠĠĠĠĠĠĠ Ġ
ct coolgencore
Ġ3 5
() +
break exception
Ġ5 5
imp ort
pa ck
Ġ9 3
per mitted
ĉĉĉĉĉĉ ĠĠĠ
-- --
stat us
15 0
ss age
whil e
uniqu e
pack age
0 3
0 41
1 41
1 31
8 31
9 001
9 05
9 041
9 141
9 831
a ck
b ack
c mp
c pt
c reference
c create
d f
d l
d ialect
f m
h n
i se
l t
m v
n g
n t
s tr
t her
w ise
Ġ list
Ġ and
Ġ roll
Ġ already
Ġ authority
on e
Ġc reference
Ġc update
Ġc create
in ser
ex cpt
Ġex ists
ĉĉĉ Ġ
Ġ1 9
ĉĉĉĉ Ġ
Ġ2 0
Ġ3 2
Ġ3 3
Ġo ther
ĉĉĉĉĉ ĠĠĠ
Ġmove member
Ġ5 6
Ġ9 6
Ġ> =
905 1
cmp nt
df lt
dl ng
fm t
hn dlng
Ġroll back
inser t
excpt n
Ġother wise
) );
< =",
a ch
a pe
c at
c key
c update
d o
d er
e sc
e ssage
e ach
f i
g in
h ro
l e
n ex
o pt
p reference
p update
r b
r ent
r codes
r un
s um
t im
t hro
v id
| |
Ġ li
Ġ tr
Ġ error
Ġ ur
Ġ text
Ġ or
Ġ ori
Ġ filter
Ġ break
Ġ read
Ġ unique
Ġ each
Ġ tim
Ġ ||
Ġ! =
re pe
ĠĠĠĠĠĠ čĊ
Ġi f
Ġm essage
Ġc ur
Ġc key
li ent
in d
in di
ex ist
ex ists
Ġs or
Ġs witch
Ġex it
et ime
01 3
01 4
01 5
01 6
01 7
01 8
01 9
Ġp reference
Ġp update
st d
sc end
02 0
02 2
02 7
02 8
tex it
ĉĉĉĉ ĉĉĉ
ate timestamp
Ġ( !
Ġd ialect
Ġd rcodes
Ġd atetimestamp
or der
ser vid
Ġct coolgenglobal
Ġct breakexception
Ġ" <=",
Ġst d
se texit
me ssage
eck sum
ct breakexception
Ġ3 4
Ġ3 6
Ġ3 8
Ġ< ----
unt il
el d
Ġde scend
Ġch ecksum
not unique
Ġ9 4
Ġ9 5
Ġ9 9
ĠĠĠĠĠĠĠĠĠĠĠĠ Ġ
im ize
add order
already exists
identifiers get
Ġis olation
Ġb e
Ġb y
03 51
cat or
esc ape
fi eld
nex t
opt imize
thro w
Ġli ke
Ġtr ue
Ġori gin
Ġtim etime
repe at
Ġcur rent
indi cator
Ġsor ted
Ġ<---- --
Ġdescend ing
addorder field
Ġtimetime stamp
