{"<s>":0,"<pad>":1,"</s>":2,"<unk>":3,"<mask>":4,"!":5,"\"":6,"#":7,"$":8,"%":9,"&":10,"'":11,"(":12,")":13,"*":14,"+":15,",":16,"-":17,".":18,"/":19,"0":20,"1":21,"2":22,"3":23,"4":24,"5":25,"6":26,"7":27,"8":28,"9":29,":":30,";":31,"<":32,"=":33,">":34,"?":35,"@":36,"A":37,"B":38,"C":39,"D":40,"E":41,"F":42,"G":43,"H":44,"I":45,"J":46,"K":47,"L":48,"M":49,"N":50,"O":51,"P":52,"Q":53,"R":54,"S":55,"T":56,"U":57,"V":58,"W":59,"X":60,"Y":61,"Z":62,"[":63,"\\":64,"]":65,"^":66,"_":67,"`":68,"a":69,"b":70,"c":71,"d":72,"e":73,"f":74,"g":75,"h":76,"i":77,"j":78,"k":79,"l":80,"m":81,"n":82,"o":83,"p":84,"q":85,"r":86,"s":87,"t":88,"u":89,"v":90,"w":91,"x":92,"y":93,"z":94,"{":95,"|":96,"}":97,"~":98,"¡":99,"¢":100,"£":101,"¤":102,"¥":103,"¦":104,"§":105,"¨":106,"©":107,"ª":108,"«":109,"¬":110,"®":111,"¯":112,"°":113,"±":114,"²":115,"³":116,"´":117,"µ":118,"¶":119,"·":120,"¸":121,"¹":122,"º":123,"»":124,"¼":125,"½":126,"¾":127,"¿":128,"À":129,"Á":130,"Â":131,"Ã":132,"Ä":133,"Å":134,"Æ":135,"Ç":136,"È":137,"É":138,"Ê":139,"Ë":140,"Ì":141,"Í":142,"Î":143,"Ï":144,"Ð":145,"Ñ":146,"Ò":147,"Ó":148,"Ô":149,"Õ":150,"Ö":151,"×":152,"Ø":153,"Ù":154,"Ú":155,"Û":156,"Ü":157,"Ý":158,"Þ":159,"ß":160,"à":161,"á":162,"â":163,"ã":164,"ä":165,"å":166,"æ":167,"ç":168,"è":169,"é":170,"ê":171,"ë":172,"ì":173,"í":174,"î":175,"ï":176,"ð":177,"ñ":178,"ò":179,"ó":180,"ô":181,"õ":182,"ö":183,"÷":184,"ø":185,"ù":186,"ú":187,"û":188,"ü":189,"ý":190,"þ":191,"ÿ":192,"Ā":193,"ā":194,"Ă":195,"ă":196,"Ą":197,"ą":198,"Ć":199,"ć":200,"Ĉ":201,"ĉ":202,"Ċ":203,"ċ":204,"Č":205,"č":206,"Ď":207,"ď":208,"Đ":209,"đ":210,"Ē":211,"ē":212,"Ĕ":213,"ĕ":214,"Ė":215,"ė":216,"Ę":217,"ę":218,"Ě":219,"ě":220,"Ĝ":221,"ĝ":222,"Ğ":223,"ğ":224,"Ġ":225,"ġ":226,"Ģ":227,"ģ":228,"Ĥ":229,"ĥ":230,"Ħ":231,"ħ":232,"Ĩ":233,"ĩ":234,"Ī":235,"ī":236,"Ĭ":237,"ĭ":238,"Į":239,"į":240,"İ":241,"ı":242,"Ĳ":243,"ĳ":244,"Ĵ":245,"ĵ":246,"Ķ":247,"ķ":248,"ĸ":249,"Ĺ":250,"ĺ":251,"Ļ":252,"ļ":253,"Ľ":254,"ľ":255,"Ŀ":256,"ŀ":257,"Ł":258,"ł":259,"Ń":260,"ĠĠ":261,"čĊ":262,"ĠĠĠĠ":263,"en":264,"ĉĉ":265,"ent":266,"Ġ!":267,"er":268,"co":269,"ut":270,"on":271,"it":272,"re":273,"oc":274,"ĠĠĠĠĠĠ":275,"Ġi":276,"te":277,"yy":278,"loc":279,"al":280,"00":281,"ro":282,"ity":283,"Ġm":284,"entity":285,"de":286,"ĠĠĠ":287,"Ġc":288,"mp":289,"li":290,"put":291,"in":292,"ex":293,"local":294,"localentity":295,"Ġ+":296,"ec":297,"Ġs":298,"ri":299,"Ġ{":300,"tr":301,"at":302,"Ġex":303,"..":304,"ub":305,"Ġ=":306,"out":307,"ch":308,"Ġ+-":309,"id":310,"ĉĉĉ":311,"as":312,"code":313,"comp":314,"onent":315,"component":316,"Ġiyy":317,"ver":318,"Ġv":319,"output":320,"et":321,"pub":322,"lic":323,"public":324,"ion":325,");":326,"Ġ1":327,"01":328,"Ġp":329,"001":330,"erro":331,"error":332,"an":333,"to":334,"ob":335,"ect":336,"st":337,"obj":338,"Ġto":339,"sc":340,"Ġloc":341,"002":342,"ew":343,"02":344,"ar":345,"ce":346,"ur":347,"ain":348,"tex":349,"train":350,"ĉĉĉĉ":351,"tur":352,"retur":353,"text":354,"return":355,"Ġin":356,"arent":357,"oid":358,"over":359,"ride":360,"Ġexp":361,"...":362,"Ġvoid":363,"object":364,"override":365,"up":366,"Ġ2":367,"ate":368,"Ġ(":369,"qu":370,"ge":371,"Ġd":372,"ted":373,"07":374,"Ġ+--":375,"Ġcyy":376,"list":377,"ont":378,"chan":379,"change":380,"Ġset":381,"Ġ+->":382,"cted":383,"tected":384,"rotected":385,"ation":386,"codes":387,"ed":388,"or":389,"ser":390,"Ġn":391,"il":392,"pt":393,"Ġ15":394,"aut":395,"db":396,"outputs":397,"auth":398,"ery":399,"query":400,"protected":401,"Ġct":402,"ori":403,"authori":404,"authoriz":405,"Ġimp":406,"gro":407,"ĉĉčĊ":408,"group":409,"Ġw":410,"ol":411,"Ġdont":412,"authorization":413,"();":414,"end":415,"iyy":416,"con":417,"attr":418,"ial":419,"las":420,"puts":421,"lass":422,"gen":423,"iz":424,"cool":425,"Ġnew":426,"ize":427,"coolgen":428,"Ġ4":429,"ute":430,"ecute":431,"itial":432,"itialize":433,"Ġparent":434,"if":435,"Ġvi":436,"011":437,"un":438,"Ġ\"":439,"Ġst":440,"05":441,"core":442,"coolgencore":443,"023":444,"Ġstate":445,"fer":446,"ment":447,"Ġoutputs":448,"ence":449,"refer":450,"Ġisc":451,"Ġview":452,"ments":453,"reference":454,"2023":455,"roc":456,"ure":457,"Ġ07":458,"reas":459,"Ġclass":460,"Ġproc":461,"Ġinputs":462,"Ġ+---":463,"edure":464,"Ġstatements":465,"reason":466,"Ġprocedure":467,"se":468,"tend":469,"Ġexecute":470,"Ġextend":471,"Ġinitialize":472,"Ġctcoolgencore":473,"Ġextends":474,"fo":475,"ĉčĊ":476,"ke":477,"me":478,"ov":479,"ase":480,"server":481,"key":482,"ove":483,"parent":484,"rea":485,"ort":486,"rd":487,"cord":488,"record":489,"ĠĠĠĠĠĠĠ":490,"Ġwh":491,"003":492,"Ġ+>":493,"ption":494,"get":495,"ript":496,"ata":497,"ubsc":498,"ubscript":499,"data":500,"ĠĠĠĠĠĠĠĠ":501,"eck":502,"putentity":503,"inputentity":504,"context":505,"ct":506,"ll":507,"Ġ3":508,"check":509,"Ġo":510,"user":511,"];":512,"11":513,"case":514,"fil":515,"ter":516,"ĉĉĉĉĉ":517,"info":518,"Ġ27":519,"filter":520,"com":521,"Ġof":522,"()":523,"fa":524,"ot":525,"ĉĉĉĉčĊ":526,"ork":527,"Ġwork":528,"pkey":529,"Ġ<":530,"and":531,"ces":532,"roll":533,"set":534,"ul":535,"Ġreturn":536,"ild":537,"Ġctdb":538,"08":539,"brea":540,"Ġgroup":541,"yyy":542,"ĉĉĉčĊ":543,"authorizationcheck":544,"081":545,"break":546,"Ġmove":547,"mand":548,"command":549,"move":550,"option":551,"Ġ5":552,"004":553,"unt":554,"ber":555,"date":556,"mber":557,"Ġ46":558,"member":559,"am":560,"dont":561,"el":562,"nect":563,"ount":564,"Ġde":565,"entityquery":566,"Ġdyyy":567,"dbcon":568,"Ġwhen":569,"ctdb":570,"fail":571,"amount":572,"nection":573,"dbconnection":574,"imp":575,"subscript":576,"Ġch":577,"Ġsubscript":578,"update":579,"read":580,"\",":581,"und":582,"found":583,"movemember":584,"else":585,"10":586,"cre":587,"fro":588,"userid":589,"Ġchild":590,"create":591,"from":592,"cces":593,"ful":594,"not":595,"pe":596,"sful":597,"ucces":598,"exce":599,"Ġ18":600,"Ġ45":601,"orts":602,"failed":603,"uccessful":604,"exception":605,"ich":606,"Ġquery":607,"Ġfrom":608,"ing":609,"dberror":610,"Ġwhich":611,"Ġctdbquery":612,"ime":613,"pa":614,"si":615,"Ġentity":616,"Ġpkey":617,"Ġ29":618,"ms":619,"Ġ9":620,"tring":621,"Ġ28":622,"msg":623,"41":624,"amp":625,"per":626,"ty":627,"time":628,"asc":629,"verity":630,"stamp":631,"021":632,"setsubscript":633,"type":634,"))":635,"croll":636,"equ":637,"006":638,"Ġcat":639,"Ġscroll":640,"scroll":641,"ĉĉĉĉĉĉ":642,"Ġ49":643,"ĠĠĠĠĠĠĠĠĠĠĠĠ":644,"equal":645,"Ġcatch":646,"(\"":647,"ax":648,"ger":649,"isc":650,"sort":651,"tal":652,"ue":653,"um":654,"val":655,"teger":656,"Ġcase":657,"inst":658,"integer":659,"Ġsort":660,"tran":661,"012":662,"ance":663,"Ġ21":664,"Ġcyyy":665,"paces":666,"timestamp":667,"instance":668,"ame":669,"class":670,"her":671,"name":672,"string":673,"wit":674,"Ġreason":675,"ĉĉĠ":676,"init":677,"inputs":678,"try":679,"getname":680,"());":681,"setdbconnection":682,"Ġctdbentityquery":683,"ctdbentityquery":684,"ctdbexception":685,"ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ":686,"trans":687,"witch":688,"\":":689,"--":690,"09":691,"31":692,"40":693,"ad":694,"im":695,"oper":696,"use":697,"ull":698,"Ġelse":699,"Ġuserid":700,"Ġuse":701,"005":702,"execute":703,"arch":704,"Ġexports":705,"authorized":706,"olation":707,"unauthorized":708,"search":709,"ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ":710,"1110":711,"faul":712,"add":713,"operation":714,"fault":715,"cg":716,"successful":717,"switch":718,"default":719,"initialize":720,"Ġsuccessful":721,"child":722,"errorcode":723,"ĉĉĉĉĉĉčĊ":724,"geterrorcode":725,"\"))":726,"=>":727,"age":728,"di":729,"dit":730,"everity":731,"lb":732,"mit":733,"ok":734,"pli":735,"sup":736,"Ġcom":737,"ĠĠĠĠĠĠĠĠĠĠ":738,"red":739,"Ġ+=>":740,"Ġspaces":741,"Ġseverity":742,"Ġ26":743,"Ġimports":744,"condit":745,"Ġ30":746,"other":747,"Ġdesi":748,"0121":749,"addcondit":750,"mitted":751,"plied":752,"supplied":753,"Ġdesired":754,"addcondition":755,"\";":756,"=\",":757,"ck":758,"gl":759,"gn":760,"ist":761,"ore":762,"send":763,"Ġ-":764,"Ġ>":765,"Ġ}":766,"Ġpublic":767,"ĠĠĠĠĠ":768,"alread":769,"Ġsend":770,"obal":771,"Ġ23":772,"coolgengl":773,"getsubscript":774,"())":775,"Ġ50":776,"sign":777,"equalsign":778,"orecase":779,"already":780,"coolgenglobal":781,"equalsignorecase":782,"20":783,"51":784,"cparent":785,"cinstance":786,"fet":787,"ier":788,"max":789,"null":790,"Ġreference":791,"entif":792,"ere":793,"erver":794,"rect":795,"Ġmax":796,"Ġcparent":797,"Ġcinstance":798,"inval":799,"exp":800,"Ġserver":801,"chentity":802,"identif":803,"Ġprotected":804,"Ġpsearch":805,"total":806,"Ġtotal":807,"0211":808,"Ġ22":809,"ority":810,"Ġnot":811,"authority":812,"severity":813,"Ġwhere":814,"getmax":815,"1120":816,"ĉĉĉĉĉĠĠĠĠĠĠĠ":817,"Ġ<=":818,"equals":819,"value":820,"imum":821,"direct":822,"fetchentity":823,"iers":824,"invalid":825,"identifiers":826,"getmaximum":827,"direction":828,"cyyy":829,"ly":830,"Ġg":831,"ĠčĊ":832,"Ġon":833,"Ġcontext":834,"Ġis":835,"Ġ==":836,"stat":837,"ialect":838,"Ġ40":839,"ctcoolgenglobal":840,"Ġ31":841,"Ġ53":842,"ists":843,"Ġonly":844,"15":845,"101":846,"base":847,"cd":848,"full":849,"hil":850,"iqu":851,"iolation":852,"lect":853,"num":854,"psearch":855,"pother":856,"ss":857,"spaces":858,"tx":859,"us":860,"violation":861,"whil":862,"Ġ0":863,"Ġb":864,"Ġfound":865,"Ġtype":866,"ermitted":867,"locate":868,"alue":869,"007":870,"008":871,"009":872,"des":873,"Ġstring":874,"Ġvalue":875,"Ġ11":876,"Ġ16":877,"Ġ17":878,"Ġ101":879,"010":880,"0131":881,"0151":882,"Ġpother":883,"Ġpermitted":884,"Ġ24":885,"Ġ25":886,"groupent":887,"groupentity":888,"Ġ47":889,"Ġviolation":890,"uniqu":891,"Ġ\"=\",":892,"select":893,"getgroupentity":894,"ĠĠĠĠĠĠĠĠĠ":895,"ctcoolgencore":896,"Ġ35":897,"()+":898,"breakexception":899,"Ġ55":900,"import":901,"pack":902,"Ġ93":903,"permitted":904,"ĉĉĉĉĉĉĠĠĠ":905,"----":906,"status":907,"150":908,"ssage":909,"while":910,"unique":911,"package":912,"03":913,"041":914,"141":915,"131":916,"831":917,"9001":918,"905":919,"9041":920,"9141":921,"9831":922,"ack":923,"back":924,"cmp":925,"cpt":926,"creference":927,"ccreate":928,"df":929,"dl":930,"dialect":931,"fm":932,"hn":933,"ise":934,"lt":935,"mv":936,"ng":937,"nt":938,"str":939,"ther":940,"wise":941,"Ġlist":942,"Ġand":943,"Ġroll":944,"Ġalready":945,"Ġauthority":946,"one":947,"Ġcreference":948,"Ġcupdate":949,"Ġccreate":950,"inser":951,"excpt":952,"Ġexists":953,"ĉĉĉĠ":954,"Ġ19":955,"ĉĉĉĉĠ":956,"Ġ20":957,"Ġ32":958,"Ġ33":959,"Ġother":960,"ĉĉĉĉĉĠĠĠ":961,"Ġmovemember":962,"Ġ56":963,"Ġ96":964,"Ġ>=":965,"9051":966,"cmpnt":967,"dflt":968,"dlng":969,"fmt":970,"hndlng":971,"Ġrollback":972,"insert":973,"excptn":974,"Ġotherwise":975,"));":976,"<=\",":977,"ach":978,"ape":979,"cat":980,"ckey":981,"cupdate":982,"do":983,"der":984,"esc":985,"essage":986,"each":987,"fi":988,"gin":989,"hro":990,"le":991,"nex":992,"opt":993,"preference":994,"pupdate":995,"rb":996,"rent":997,"rcodes":998,"run":999,"sum":1000,"tim":1001,"thro":1002,"vid":1003,"||":1004,"Ġli":1005,"Ġtr":1006,"Ġerror":1007,"Ġur":1008,"Ġtext":1009,"Ġor":1010,"Ġori":1011,"Ġfilter":1012,"Ġbreak":1013,"Ġread":1014,"Ġunique":1015,"Ġeach":1016,"Ġtim":1017,"Ġ||":1018,"Ġ!=":1019,"repe":1020,"ĠĠĠĠĠĠčĊ":1021,"Ġif":1022,"Ġmessage":1023,"Ġcur":1024,"Ġckey":1025,"lient":1026,"ind":1027,"indi":1028,"exist":1029,"exists":1030,"Ġsor":1031,"Ġswitch":1032,"Ġexit":1033,"etime":1034,"013":1035,"014":1036,"015":1037,"016":1038,"017":1039,"018":1040,"019":1041,"Ġpreference":1042,"Ġpupdate":1043,"std":1044,"scend":1045,"020":1046,"022":1047,"027":1048,"028":1049,"texit":1050,"ĉĉĉĉĉĉĉ":1051,"atetimestamp":1052,"Ġ(!":1053,"Ġdialect":1054,"Ġdrcodes":1055,"Ġdatetimestamp":1056,"order":1057,"servid":1058,"Ġctcoolgenglobal":1059,"Ġctbreakexception":1060,"Ġ\"<=\",":1061,"Ġstd":1062,"setexit":1063,"message":1064,"ecksum":1065,"ctbreakexception":1066,"Ġ34":1067,"Ġ36":1068,"Ġ38":1069,"Ġ<----":1070,"until":1071,"eld":1072,"Ġdescend":1073,"Ġchecksum":1074,"notunique":1075,"Ġ94":1076,"Ġ95":1077,"Ġ99":1078,"ĠĠĠĠĠĠĠĠĠĠĠĠĠ":1079,"imize":1080,"addorder":1081,"alreadyexists":1082,"identifiersget":1083,"Ġisolation":1084,"Ġbe":1085,"Ġby":1086,"0351":1087,"cator":1088,"escape":1089,"field":1090,"next":1091,"optimize":1092,"throw":1093,"Ġlike":1094,"Ġtrue":1095,"Ġorigin":1096,"Ġtimetime":1097,"repeat":1098,"Ġcurrent":1099,"indicator":1100,"Ġsorted":1101,"Ġ<------":1102,"Ġdescending":1103,"addorderfield":1104,"Ġtimetimestamp":1105}