#version: 0.2
Ġ Ġ
č Ċ
ĠĠ ĠĠ
ĉ ĉ
e n
en t
Ġ !
c o
e r
u t
o n
r e
i t
o c
Ġ i
ĠĠĠĠ ĠĠ
t e
y y
l oc
0 0
a l
it y
Ġ m
r o
ent ity
d e
ĠĠ Ġ
Ġ c
m p
p ut
i n
e x
loc al
local entity
l i
s e
Ġ +
e c
r i
a t
t r
Ġ {
Ġ ex
c h
Ġ =
. .
o ut
u b
ĉĉ ĉ
i d
co de
Ġ+ -
co mp
on ent
comp onent
s t
i on
out put
Ġ v
) ;
Ġi yy
v er
p ub
li c
pub lic
a n
Ġ 1
00 1
0 1
g e
s c
Ġ p
er ro
erro r
t o
o b
ec t
ob j
Ġ to
re a
e w
u r
a r
se t
0 2
c e
t ur
re tur
retur n
ĉĉ ĉĉ
Ġ loc
00 2
a in
tr ain
ar ent
te x
q u
tex t
Ġi n
Ġex p
Ġ d
o id
o ver
ri de
.. .
Ġv oid
obj ect
over ride
Ġ (
u p
Ġ 2
at ion
on t
ch an
chan ge
te d
d b
s er
code s
a ut
h o
Ġ n
aut ho
Ġ+- -
Ġ set
0 7
e d
i l
er y
qu ery
Ġc yy
ri z
autho riz
c ted
s s
te cted
ro tected
Ġ+- >
Ġ1 5
Ġc t
output s
p rotected
Ġi mp
a te
ĉĉ čĊ
o r
p t
li st
o l
authoriz ation
g ro
Ġd ont
gro up
Ġ w
( );
en d
co n
Ġ 4
g en
co ol
at tr
Ġn ew
cool gen
a se
a ss
i al
l ass
put s
i yy
i z
Ġ "
iz e
co re
ut e
Ġi sc
ec ute
Ġv i
Ġp arent
coolgen core
f o
u n
it ial
itial ize
Ġ s
f er
en ce
re fer
refer ence
Ġ outputs
Ġvi ew
Ġ st
0 5
s on
rea son
02 3
Ġst ate
m ent
ment s
2 023
k e
p arent
r oc
u re
Ġ 07
Ġc lass
Ġp roc
Ġin puts
Ġ+-- -
ed ure
Ġstate ments
Ġproc edure
t end
Ġex ecute
Ġex tend
Ġin itialize
Ġct coolgencore
Ġextend s
o v
r d
co rd
re cord
ser ver
ke y
ov e
01 1
i f
m e
Ġ+ >
ĠĠĠĠĠĠ Ġ
co m
Ġw h
ĉ čĊ
or t
c t
ĠĠĠĠ ĠĠĠĠ
00 3
1 1
put entity
in putentity
ec k
c ase
u ser
at a
d ata
ch eck
u l
ri pt
ub sc
ge t
ubsc ript
Ġ o
in fo
con text
Ġ 3
pt ion
f a
ĉĉ ĉĉĉ
ĉĉĉĉ čĊ
Ġ2 7
il d
] ;
o t
p key
an d
b rea
Ġo f
brea k
( )
Ġct db
0 8
08 1
Ġ return
m and
Ġ group
com mand
Ġ4 5
yy y
or k
Ġw ork
f il
m ove
t er
fa il
fil ter
c rea
Ġc h
authorization check
crea te
Ġm ove
Ġwh en
1 0
ĉĉĉ čĊ
Ġch ild
d ont
f ul
n ect
Ġ <
entity query
Ġ1 8
Ġd yyy
db con
fo un
ct db
nect ion
dbcon nection
foun d
b er
i mp
l l
m ber
ro ll
me mber
Ġ 5
Ġ de
d ate
rea d
user id
c ce
n ot
u cce
sc roll
ss ful
move member
fail ed
ucce ssful
c g
s ubscript
up date
db error
Ġs ubscript
Ġctdb query
" ,
e l
o ption
p a
p er
Ġ entity
Ġ com
00 4
un t
f ro
Ġ query
Ġ4 6
fro m
a m
o unt
ex ce
ort s
el se
am ount
exce ption
i ch
Ġ from
Ġwh ich
Ġc ase
in st
an ce
01 2
Ġp key
02 1
inst ance
" :
4 0
i sc
i me
o per
p e
s i
t ime
tr an
set subscript
authoriz ed
un authorized
11 10
oper ation
w it
00 6
Ġc at
in g
ĉĉĉĉ ĉĉ
Ġ2 8
ĠĠĠĠĠĠĠĠ ĠĠĠĠ
tran s
wit ch
Ġcat ch
0 9
a ge
u e
00 5
Ġ2 9
ĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠ
a me
c k
c lass
m s
n ame
s witch
Ġ 9
in it
in puts
tr y
tr ing
ch ild
set dbconnection
get name
() );
Ġctdb entityquery
ctdb entityquery
ctdb exception
ĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠ
ms g
4 1
a mp
a sc
t y
v al
Ġ userid
se ver
st amp
Ġ2 1
ol ation
time stamp
ty pe
sever ity
) )
e qu
h er
s uccessful
Ġ reason
Ġ scroll
error code
ĉĉĉĉ ĉĉčĊ
Ġ4 9
Ġs uccessful
get errorcode
equ al
( "
a d
a x
b ase
g er
m it
s ort
t al
u m
u se
Ġ use
te ger
in teger
ex ecute
ce s
Ġexp orts
Ġcyy y
Ġs ort
ct coolgencore
ul t
fa ult
imp ort
pa ck
pa ces
012 1
ad d
mit ted
pack age
i st
s end
s tring
ĉĉ Ġ
al read
de fault
in itialize
Ġs end
alread y
- -
3 1
= >
c parent
c instance
d it
Ġ else
re d
Ġc parent
Ġc instance
se ar
Ġ+ =>
02 11
Ġimp orts
con dit
Ġ3 0
ĉĉĉĉĉ ĠĠĠĠĠĠĠ
Ġde si
add condit
sear ch
Ġdesi red
addcondit ion
= ",
Ġ2 3
() )
Ġ5 3
ist s
" ))
d i
e t
f et
i m
l b
n ul
o k
p li
s up
Ġ reference
Ġ severity
ĠĠĠĠ ĠĠĠĠĠĠ
er e
ch entity
01 0
Ġ2 2
Ġ2 6
Ġn ot
Ġ4 7
Ġs paces
Ġwh ere
ot her
val ue
fet chentity
nul l
pli ed
sup plied
" ;
g l
g n
l y
o re
Ġ -
Ġ >
Ġ }
Ġ on
Ġ public
ĠĠĠĠ Ġ
Ġ= =
ob al
coolgen gl
get subscript
Ġ3 1
Ġ5 0
si gn
equal sign
ore case
Ġon ly
coolgengl obal
equalsign orecase
1 01
2 0
5 1
i er
i olation
l ect
m ax
r ity
v iolation
Ġ server
Ġ found
ent if
er mitted
re ct
loc ate
al ue
Ġm ax
in val
ex p
se lect
id entif
Ġv alue
Ġ1 6
Ġ1 7
Ġ1 01
Ġp rotected
Ġp search
Ġp ermitted
to tal
Ġto tal
autho rity
Ġ" =",
Ġvi olation
11 20
get max
Ġ< =
per mitted
ĉĉĉĉĉĉ ĠĠĠ
equal s
di rect
im um
ier s
inval id
identif iers
getmax imum
direct ion
c reference
c yyy
c create
i se
t her
w ise
Ġ g
Ġ čĊ
Ġ context
Ġ already
Ġi s
Ġc reference
Ġc create
Ġc update
in ser
Ġex ists
st at
Ġ1 9
Ġ2 0
Ġ4 0
ial ect
ct coolgenglobal
Ġo ther
inser t
Ġother wise
1 5
c d
c update
h il
i qu
n um
p search
p other
s paces
t x
u s
w hil
Ġ 0
Ġ b
Ġ type
00 7
00 8
00 9
de s
ex ists
Ġ1 1
01 4
01 31
01 51
Ġp other
Ġ2 4
Ġ2 5
ss age
group ent
group entity
un iqu
Ġs tring
ĠĠĠĠĠĠĠĠ Ġ
get groupentity
Ġ3 5
break exception
() +
ful l
Ġ5 5
Ġ9 3
already exists
-- --
stat us
15 0
whil e
uniqu e
0 3
0 41
1 41
1 31
8 31
9 001
9 05
9 041
9 141
9 831
a s
a ck
b ack
c mp
c pt
d f
d l
d ialect
f m
h n
l t
m v
n g
n t
s tr
Ġ list
Ġ and
Ġ roll
Ġ authority
on e
ex cpt
ĉĉĉ Ġ
ĉĉĉĉ Ġ
Ġ3 2
Ġ3 3
ĉĉĉĉĉ ĠĠĠ
Ġmove member
Ġ5 6
Ġ9 6
Ġ> =
905 1
cmp nt
df lt
dl ng
fm t
hn dlng
Ġroll back
excpt n
) );
< =",
a ch
a pe
c at
c key
d o
d er
e sc
e ssage
e ach
f i
g in
h ro
l e
n ex
o pt
p reference
p update
r b
r ent
r codes
r un
s um
t hro
v id
| |
Ġ li
Ġ tr
Ġ error
Ġ ur
Ġ text
Ġ or
Ġ break
Ġ filter
Ġ read
Ġ time
Ġ unique
Ġ each
Ġ ||
Ġ! =
re pe
Ġi f
ĠĠĠĠĠĠ čĊ
Ġm essage
Ġc ur
Ġc key
in d
in di
ex ist
li ent
se tex
ri gin
Ġex it
st d
01 3
01 5
01 6
01 7
01 8
01 9
sc end
Ġp reference
Ġp update
02 0
02 2
02 7
02 8
ĉĉĉĉ ĉĉĉ
Ġd ate
Ġd ialect
Ġd rcodes
Ġ( !
ser vid
Ġct coolgenglobal
Ġct breakexception
or ted
or der
Ġ" <=",
Ġs witch
Ġs orted
Ġst d
me ssage
ct breakexception
eck sum
Ġo rigin
Ġ3 4
Ġ3 6
Ġ3 8
Ġch ecksum
Ġ< ----
Ġde scend
not unique
el d
unt il
ĠĠĠĠĠĠĠĠĠĠĠĠ Ġ
Ġ9 4
Ġ9 5
Ġ9 9
add order
im ize
identifiers get
Ġis olation
Ġb e
Ġb y
03 51
cat or
esc ape
fi eld
nex t
opt imize
thro w
Ġli ke
Ġtr ue
Ġtime timestamp
repe at
Ġcur rent
indi cator
setex it
Ġdate timestamp
Ġ<---- --
Ġdescend ing
addorder field
