{"<s>":0,"<pad>":1,"</s>":2,"<unk>":3,"<mask>":4,"!":5,"\"":6,"#":7,"$":8,"%":9,"&":10,"'":11,"(":12,")":13,"*":14,"+":15,",":16,"-":17,".":18,"/":19,"0":20,"1":21,"2":22,"3":23,"4":24,"5":25,"6":26,"7":27,"8":28,"9":29,":":30,";":31,"<":32,"=":33,">":34,"?":35,"@":36,"A":37,"B":38,"C":39,"D":40,"E":41,"F":42,"G":43,"H":44,"I":45,"J":46,"K":47,"L":48,"M":49,"N":50,"O":51,"P":52,"Q":53,"R":54,"S":55,"T":56,"U":57,"V":58,"W":59,"X":60,"Y":61,"Z":62,"[":63,"\\":64,"]":65,"^":66,"_":67,"`":68,"a":69,"b":70,"c":71,"d":72,"e":73,"f":74,"g":75,"h":76,"i":77,"j":78,"k":79,"l":80,"m":81,"n":82,"o":83,"p":84,"q":85,"r":86,"s":87,"t":88,"u":89,"v":90,"w":91,"x":92,"y":93,"z":94,"{":95,"|":96,"}":97,"~":98,"¡":99,"¢":100,"£":101,"¤":102,"¥":103,"¦":104,"§":105,"¨":106,"©":107,"ª":108,"«":109,"¬":110,"®":111,"¯":112,"°":113,"±":114,"²":115,"³":116,"´":117,"µ":118,"¶":119,"·":120,"¸":121,"¹":122,"º":123,"»":124,"¼":125,"½":126,"¾":127,"¿":128,"À":129,"Á":130,"Â":131,"Ã":132,"Ä":133,"Å":134,"Æ":135,"Ç":136,"È":137,"É":138,"Ê":139,"Ë":140,"Ì":141,"Í":142,"Î":143,"Ï":144,"Ð":145,"Ñ":146,"Ò":147,"Ó":148,"Ô":149,"Õ":150,"Ö":151,"×":152,"Ø":153,"Ù":154,"Ú":155,"Û":156,"Ü":157,"Ý":158,"Þ":159,"ß":160,"à":161,"á":162,"â":163,"ã":164,"ä":165,"å":166,"æ":167,"ç":168,"è":169,"é":170,"ê":171,"ë":172,"ì":173,"í":174,"î":175,"ï":176,"ð":177,"ñ":178,"ò":179,"ó":180,"ô":181,"õ":182,"ö":183,"÷":184,"ø":185,"ù":186,"ú":187,"û":188,"ü":189,"ý":190,"þ":191,"ÿ":192,"Ā":193,"ā":194,"Ă":195,"ă":196,"Ą":197,"ą":198,"Ć":199,"ć":200,"Ĉ":201,"ĉ":202,"Ċ":203,"ċ":204,"Č":205,"č":206,"Ď":207,"ď":208,"Đ":209,"đ":210,"Ē":211,"ē":212,"Ĕ":213,"ĕ":214,"Ė":215,"ė":216,"Ę":217,"ę":218,"Ě":219,"ě":220,"Ĝ":221,"ĝ":222,"Ğ":223,"ğ":224,"Ġ":225,"ġ":226,"Ģ":227,"ģ":228,"Ĥ":229,"ĥ":230,"Ħ":231,"ħ":232,"Ĩ":233,"ĩ":234,"Ī":235,"ī":236,"Ĭ":237,"ĭ":238,"Į":239,"į":240,"İ":241,"ı":242,"Ĳ":243,"ĳ":244,"Ĵ":245,"ĵ":246,"Ķ":247,"ķ":248,"ĸ":249,"Ĺ":250,"ĺ":251,"Ļ":252,"ļ":253,"Ľ":254,"ľ":255,"Ŀ":256,"ŀ":257,"Ł":258,"ł":259,"Ń":260,"ĠĠ":261,"čĊ":262,"ĠĠĠĠ":263,"ĉĉ":264,"en":265,"ent":266,"Ġ!":267,"co":268,"er":269,"ut":270,"on":271,"re":272,"it":273,"oc":274,"Ġi":275,"ĠĠĠĠĠĠ":276,"te":277,"yy":278,"loc":279,"00":280,"al":281,"ity":282,"Ġm":283,"ro":284,"entity":285,"de":286,"ĠĠĠ":287,"Ġc":288,"mp":289,"put":290,"in":291,"ex":292,"local":293,"localentity":294,"li":295,"se":296,"Ġ+":297,"ec":298,"ri":299,"at":300,"tr":301,"Ġ{":302,"Ġex":303,"ch":304,"Ġ=":305,"..":306,"out":307,"ub":308,"ĉĉĉ":309,"id":310,"code":311,"Ġ+-":312,"comp":313,"onent":314,"component":315,"st":316,"ion":317,"output":318,"Ġv":319,");":320,"Ġiyy":321,"ver":322,"pub":323,"lic":324,"public":325,"an":326,"Ġ1":327,"001":328,"01":329,"ge":330,"sc":331,"Ġp":332,"erro":333,"error":334,"to":335,"ob":336,"ect":337,"obj":338,"Ġto":339,"rea":340,"ew":341,"ur":342,"ar":343,"set":344,"02":345,"ce":346,"tur":347,"retur":348,"return":349,"ĉĉĉĉ":350,"Ġloc":351,"002":352,"ain":353,"train":354,"arent":355,"tex":356,"qu":357,"text":358,"Ġin":359,"Ġexp":360,"Ġd":361,"oid":362,"over":363,"ride":364,"...":365,"Ġvoid":366,"object":367,"override":368,"Ġ(":369,"up":370,"Ġ2":371,"ation":372,"ont":373,"chan":374,"change":375,"ted":376,"db":377,"ser":378,"codes":379,"aut":380,"ho":381,"Ġn":382,"autho":383,"Ġ+--":384,"Ġset":385,"07":386,"ed":387,"il":388,"ery":389,"query":390,"Ġcyy":391,"riz":392,"authoriz":393,"cted":394,"ss":395,"tected":396,"rotected":397,"Ġ+->":398,"Ġ15":399,"Ġct":400,"outputs":401,"protected":402,"Ġimp":403,"ate":404,"ĉĉčĊ":405,"or":406,"pt":407,"list":408,"ol":409,"authorization":410,"gro":411,"Ġdont":412,"group":413,"Ġw":414,"();":415,"end":416,"con":417,"Ġ4":418,"gen":419,"cool":420,"attr":421,"Ġnew":422,"coolgen":423,"ase":424,"ass":425,"ial":426,"lass":427,"puts":428,"iyy":429,"iz":430,"Ġ\"":431,"ize":432,"core":433,"ute":434,"Ġisc":435,"ecute":436,"Ġvi":437,"Ġparent":438,"coolgencore":439,"fo":440,"un":441,"itial":442,"itialize":443,"Ġs":444,"fer":445,"ence":446,"refer":447,"reference":448,"Ġoutputs":449,"Ġview":450,"Ġst":451,"05":452,"son":453,"reason":454,"023":455,"Ġstate":456,"ment":457,"ments":458,"2023":459,"ke":460,"parent":461,"roc":462,"ure":463,"Ġ07":464,"Ġclass":465,"Ġproc":466,"Ġinputs":467,"Ġ+---":468,"edure":469,"Ġstatements":470,"Ġprocedure":471,"tend":472,"Ġexecute":473,"Ġextend":474,"Ġinitialize":475,"Ġctcoolgencore":476,"Ġextends":477,"ov":478,"rd":479,"cord":480,"record":481,"server":482,"key":483,"ove":484,"011":485,"if":486,"me":487,"Ġ+>":488,"ĠĠĠĠĠĠĠ":489,"com":490,"Ġwh":491,"ĉčĊ":492,"ort":493,"ct":494,"ĠĠĠĠĠĠĠĠ":495,"003":496,"11":497,"putentity":498,"inputentity":499,"eck":500,"case":501,"user":502,"ata":503,"data":504,"check":505,"ul":506,"ript":507,"ubsc":508,"get":509,"ubscript":510,"Ġo":511,"info":512,"context":513,"Ġ3":514,"ption":515,"fa":516,"ĉĉĉĉĉ":517,"ĉĉĉĉčĊ":518,"Ġ27":519,"ild":520,"];":521,"ot":522,"pkey":523,"and":524,"brea":525,"Ġof":526,"break":527,"()":528,"Ġctdb":529,"08":530,"081":531,"Ġreturn":532,"mand":533,"Ġgroup":534,"command":535,"Ġ45":536,"yyy":537,"ork":538,"Ġwork":539,"fil":540,"move":541,"ter":542,"fail":543,"filter":544,"crea":545,"Ġch":546,"authorizationcheck":547,"create":548,"Ġmove":549,"Ġwhen":550,"10":551,"ĉĉĉčĊ":552,"Ġchild":553,"dont":554,"ful":555,"nect":556,"Ġ<":557,"entityquery":558,"Ġ18":559,"Ġdyyy":560,"dbcon":561,"foun":562,"ctdb":563,"nection":564,"dbconnection":565,"found":566,"ber":567,"imp":568,"ll":569,"mber":570,"roll":571,"member":572,"Ġ5":573,"Ġde":574,"date":575,"read":576,"userid":577,"cce":578,"not":579,"ucce":580,"scroll":581,"ssful":582,"movemember":583,"failed":584,"uccessful":585,"cg":586,"subscript":587,"update":588,"dberror":589,"Ġsubscript":590,"Ġctdbquery":591,"\",":592,"el":593,"option":594,"pa":595,"per":596,"Ġentity":597,"Ġcom":598,"004":599,"unt":600,"fro":601,"Ġquery":602,"Ġ46":603,"from":604,"am":605,"ount":606,"exce":607,"orts":608,"else":609,"amount":610,"exception":611,"ich":612,"Ġfrom":613,"Ġwhich":614,"Ġcase":615,"inst":616,"ance":617,"012":618,"Ġpkey":619,"021":620,"instance":621,"\":":622,"40":623,"isc":624,"ime":625,"oper":626,"pe":627,"si":628,"time":629,"tran":630,"setsubscript":631,"authorized":632,"unauthorized":633,"1110":634,"operation":635,"wit":636,"006":637,"Ġcat":638,"ing":639,"ĉĉĉĉĉĉ":640,"Ġ28":641,"ĠĠĠĠĠĠĠĠĠĠĠĠ":642,"trans":643,"witch":644,"Ġcatch":645,"09":646,"age":647,"ue":648,"005":649,"Ġ29":650,"ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ":651,"ame":652,"ck":653,"class":654,"ms":655,"name":656,"switch":657,"Ġ9":658,"init":659,"inputs":660,"try":661,"tring":662,"child":663,"setdbconnection":664,"getname":665,"());":666,"Ġctdbentityquery":667,"ctdbentityquery":668,"ctdbexception":669,"ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ":670,"msg":671,"41":672,"amp":673,"asc":674,"ty":675,"val":676,"Ġuserid":677,"sever":678,"stamp":679,"Ġ21":680,"olation":681,"timestamp":682,"type":683,"severity":684,"))":685,"equ":686,"her":687,"successful":688,"Ġreason":689,"Ġscroll":690,"errorcode":691,"ĉĉĉĉĉĉčĊ":692,"Ġ49":693,"Ġsuccessful":694,"geterrorcode":695,"equal":696,"(\"":697,"ad":698,"ax":699,"base":700,"ger":701,"mit":702,"sort":703,"tal":704,"um":705,"use":706,"Ġuse":707,"teger":708,"integer":709,"execute":710,"ces":711,"Ġexports":712,"Ġcyyy":713,"Ġsort":714,"ctcoolgencore":715,"ult":716,"fault":717,"import":718,"pack":719,"paces":720,"0121":721,"add":722,"mitted":723,"package":724,"ist":725,"send":726,"string":727,"ĉĉĠ":728,"alread":729,"default":730,"initialize":731,"Ġsend":732,"already":733,"--":734,"31":735,"=>":736,"cparent":737,"cinstance":738,"dit":739,"Ġelse":740,"red":741,"Ġcparent":742,"Ġcinstance":743,"sear":744,"Ġ+=>":745,"0211":746,"Ġimports":747,"condit":748,"Ġ30":749,"ĉĉĉĉĉĠĠĠĠĠĠĠ":750,"Ġdesi":751,"addcondit":752,"search":753,"Ġdesired":754,"addcondition":755,"=\",":756,"Ġ23":757,"())":758,"Ġ53":759,"ists":760,"\"))":761,"di":762,"et":763,"fet":764,"im":765,"lb":766,"nul":767,"ok":768,"pli":769,"sup":770,"Ġreference":771,"Ġseverity":772,"ĠĠĠĠĠĠĠĠĠĠ":773,"ere":774,"chentity":775,"010":776,"Ġ22":777,"Ġ26":778,"Ġnot":779,"Ġ47":780,"Ġspaces":781,"Ġwhere":782,"other":783,"value":784,"fetchentity":785,"null":786,"plied":787,"supplied":788,"\";":789,"gl":790,"gn":791,"ly":792,"ore":793,"Ġ-":794,"Ġ>":795,"Ġ}":796,"Ġon":797,"Ġpublic":798,"ĠĠĠĠĠ":799,"Ġ==":800,"obal":801,"coolgengl":802,"getsubscript":803,"Ġ31":804,"Ġ50":805,"sign":806,"equalsign":807,"orecase":808,"Ġonly":809,"coolgenglobal":810,"equalsignorecase":811,"101":812,"20":813,"51":814,"ier":815,"iolation":816,"lect":817,"max":818,"rity":819,"violation":820,"Ġserver":821,"Ġfound":822,"entif":823,"ermitted":824,"rect":825,"locate":826,"alue":827,"Ġmax":828,"inval":829,"exp":830,"select":831,"identif":832,"Ġvalue":833,"Ġ16":834,"Ġ17":835,"Ġ101":836,"Ġprotected":837,"Ġpsearch":838,"Ġpermitted":839,"total":840,"Ġtotal":841,"authority":842,"Ġ\"=\",":843,"Ġviolation":844,"1120":845,"getmax":846,"Ġ<=":847,"permitted":848,"ĉĉĉĉĉĉĠĠĠ":849,"equals":850,"direct":851,"imum":852,"iers":853,"invalid":854,"identifiers":855,"getmaximum":856,"direction":857,"creference":858,"cyyy":859,"ccreate":860,"ise":861,"ther":862,"wise":863,"Ġg":864,"ĠčĊ":865,"Ġcontext":866,"Ġalready":867,"Ġis":868,"Ġcreference":869,"Ġccreate":870,"Ġcupdate":871,"inser":872,"Ġexists":873,"stat":874,"Ġ19":875,"Ġ20":876,"Ġ40":877,"ialect":878,"ctcoolgenglobal":879,"Ġother":880,"insert":881,"Ġotherwise":882,"15":883,"cd":884,"cupdate":885,"hil":886,"iqu":887,"num":888,"psearch":889,"pother":890,"spaces":891,"tx":892,"us":893,"whil":894,"Ġ0":895,"Ġb":896,"Ġtype":897,"007":898,"008":899,"009":900,"des":901,"exists":902,"Ġ11":903,"014":904,"0131":905,"0151":906,"Ġpother":907,"Ġ24":908,"Ġ25":909,"ssage":910,"groupent":911,"groupentity":912,"uniqu":913,"Ġstring":914,"ĠĠĠĠĠĠĠĠĠ":915,"getgroupentity":916,"Ġ35":917,"breakexception":918,"()+":919,"full":920,"Ġ55":921,"Ġ93":922,"alreadyexists":923,"----":924,"status":925,"150":926,"while":927,"unique":928,"03":929,"041":930,"141":931,"131":932,"831":933,"9001":934,"905":935,"9041":936,"9141":937,"9831":938,"as":939,"ack":940,"back":941,"cmp":942,"cpt":943,"df":944,"dl":945,"dialect":946,"fm":947,"hn":948,"lt":949,"mv":950,"ng":951,"nt":952,"str":953,"Ġlist":954,"Ġand":955,"Ġroll":956,"Ġauthority":957,"one":958,"excpt":959,"ĉĉĉĠ":960,"ĉĉĉĉĠ":961,"Ġ32":962,"Ġ33":963,"ĉĉĉĉĉĠĠĠ":964,"Ġmovemember":965,"Ġ56":966,"Ġ96":967,"Ġ>=":968,"9051":969,"cmpnt":970,"dflt":971,"dlng":972,"fmt":973,"hndlng":974,"Ġrollback":975,"excptn":976,"));":977,"<=\",":978,"ach":979,"ape":980,"cat":981,"ckey":982,"do":983,"der":984,"esc":985,"essage":986,"each":987,"fi":988,"gin":989,"hro":990,"le":991,"nex":992,"opt":993,"preference":994,"pupdate":995,"rb":996,"rent":997,"rcodes":998,"run":999,"sum":1000,"thro":1001,"vid":1002,"||":1003,"Ġli":1004,"Ġtr":1005,"Ġerror":1006,"Ġur":1007,"Ġtext":1008,"Ġor":1009,"Ġbreak":1010,"Ġfilter":1011,"Ġread":1012,"Ġtime":1013,"Ġunique":1014,"Ġeach":1015,"Ġ||":1016,"Ġ!=":1017,"repe":1018,"Ġif":1019,"ĠĠĠĠĠĠčĊ":1020,"Ġmessage":1021,"Ġcur":1022,"Ġckey":1023,"ind":1024,"indi":1025,"exist":1026,"lient":1027,"setex":1028,"rigin":1029,"Ġexit":1030,"std":1031,"013":1032,"015":1033,"016":1034,"017":1035,"018":1036,"019":1037,"scend":1038,"Ġpreference":1039,"Ġpupdate":1040,"020":1041,"022":1042,"027":1043,"028":1044,"ĉĉĉĉĉĉĉ":1045,"Ġdate":1046,"Ġdialect":1047,"Ġdrcodes":1048,"Ġ(!":1049,"servid":1050,"Ġctcoolgenglobal":1051,"Ġctbreakexception":1052,"orted":1053,"order":1054,"Ġ\"<=\",":1055,"Ġswitch":1056,"Ġsorted":1057,"Ġstd":1058,"message":1059,"ctbreakexception":1060,"ecksum":1061,"Ġorigin":1062,"Ġ34":1063,"Ġ36":1064,"Ġ38":1065,"Ġchecksum":1066,"Ġ<----":1067,"Ġdescend":1068,"notunique":1069,"eld":1070,"until":1071,"ĠĠĠĠĠĠĠĠĠĠĠĠĠ":1072,"Ġ94":1073,"Ġ95":1074,"Ġ99":1075,"addorder":1076,"imize":1077,"identifiersget":1078,"Ġisolation":1079,"Ġbe":1080,"Ġby":1081,"0351":1082,"cator":1083,"escape":1084,"field":1085,"next":1086,"optimize":1087,"throw":1088,"Ġlike":1089,"Ġtrue":1090,"Ġtimetimestamp":1091,"repeat":1092,"Ġcurrent":1093,"indicator":1094,"setexit":1095,"Ġdatetimestamp":1096,"Ġ<------":1097,"Ġdescending":1098,"addorderfield":1099}