#version: 0.2
Ġ Ġ
č Ċ
ĠĠ ĠĠ
e n
ĉ ĉ
Ġ !
en t
e r
u t
c o
o n
i t
o c
ĠĠĠĠ ĠĠ
r e
Ġ i
y y
t e
l oc
a l
0 0
r o
it y
Ġ m
ent ity
d e
ĠĠ Ġ
Ġ c
m p
l i
p ut
loc al
local entity
e x
i n
Ġ s
Ġ +
e c
Ġ {
r i
t r
Ġ ex
. .
u b
a t
Ġ =
o ut
Ġ+ -
c h
co mp
on ent
Ġi yy
comp onent
i d
v er
co de
a s
ĉĉ ĉ
p ub
li c
pub lic
Ġ v
out put
e t
) ;
0 1
i on
Ġ 1
Ġ p
00 1
er ro
erro r
s t
t o
o b
ec t
a n
Ġ loc
ob j
Ġ to
00 2
s c
0 2
e w
a r
te x
tex t
Ġi n
a in
tr ain
c e
o id
o ver
u p
Ġ 2
ri de
.. .
Ġv oid
obj ect
over ride
Ġex p
u r
li st
Ġ (
ĉĉ ĉĉ
0 7
Ġc yy
ar ent
t ur
re tur
Ġ+- -
retur n
a te
te d
q u
Ġ d
Ġ+- >
g e
o r
p t
c ted
te cted
ro tected
Ġs et
on t
ch an
chan ge
Ġ1 5
e d
output s
p rotected
s er
code s
i l
Ġ n
Ġc t
at ion
a ut
er y
qu ery
aut h
d b
g ro
gro up
o ri
ĉĉ čĊ
Ġi mp
Ġ w
auth ori
authori z
i yy
o l
( );
i al
en d
at tr
Ġd ont
i f
co n
authoriz ation
i z
l as
put s
01 1
iz e
las s
ut e
ec ute
it ial
itial ize
g en
co ol
Ġn ew
cool gen
Ġp arent
Ġ 4
Ġs t
0 5
Ġv i
02 3
Ġst ate
m ent
s e
u n
Ġct coolgen
ment s
2 023
r oc
u re
ĉ čĊ
Ġ "
Ġ 07
Ġc lass
Ġp roc
Ġin puts
Ġ+-- -
ed ure
Ġstate ments
Ġproc edure
t end
Ġ outputs
co re
re as
Ġex ecute
Ġex tend
Ġin itialize
Ġvi ew
Ġctcoolgen core
reas on
Ġextend s
f er
en ce
re fer
refer ence
m e
Ġi sc
ser ver
k e
f o
o v
ke y
ov e
or t
pt ion
g et
l l
p arent
ĠĠĠĠĠĠ Ġ
re a
ri pt
ub sc
ubsc ript
00 3
at a
Ġw h
d ata
r d
co rd
re cord
con text
Ġ 3
ec k
f il
t er
ĠĠĠĠ ĠĠĠĠ
fil ter
put entity
in putentity
Ġ+ >
ch eck
as e
Ġ o
c t
] ;
Ġ <
ro ll
or k
Ġw ork
Ġo f
( )
u ser
ĉĉ ĉĉĉ
Ġ2 7
o t
in fo
ce s
c ase
f a
ĉĉĉ čĊ
ĉĉĉĉ čĊ
1 1
o ption
p key
s et
00 4
an d
authorization check
un t
u l
Ġ return
yy y
Ġm ove
Ġ4 6
a m
o unt
Ġ 5
Ġ group
Ġct db
am ount
0 8
d ate
e l
08 1
b er
b rea
m ber
me mber
brea k
m m
m ove
s ubscript
Ġ de
co mm
Ġs ubscript
up date
il d
el se
comm and
" ,
d ont
n ect
p e
entity query
Ġd yyy
db con
rea d
ct db
nect ion
dbcon nection
f ro
i mp
in g
Ġwh en
move member
fro m
i me
ex ce
Ġ2 9
ort s
fa il
exce ption
i ch
m s
s i
Ġ 9
Ġ from
Ġc h
tr ing
un d
fo und
Ġwh ich
user id
ms g
4 1
a mp
c ces
f ul
n ot
s ful
t y
t ime
u cces
Ġ query
ver ity
as c
Ġp key
st amp
Ġ2 8
fail ed
ty pe
ucces sful
) )
1 0
c roll
e qu
Ġs croll
sc roll
db error
Ġ4 9
Ġctdb query
Ġch ild
equ al
( "
a x
a ces
c re
g er
p aces
s ort
t al
u m
Ġ entity
te ger
in teger
Ġs ort
Ġ1 8
Ġcyy y
set subscript
time stamp
cre ate
s tring
v al
ĉĉ Ġ
00 6
Ġc at
02 1
Ġ2 1
ĉĉĉĉ ĉĉ
ĠĠĠĠĠĠĠĠ ĠĠĠĠ
Ġcat ch
- -
3 1
h er
i m
u e
Ġ reason
Ġ else
ar ch
se arch
a d
a me
c lass
i sc
n ame
p er
u se
u ll
Ġ use
ex ecute
in it
in puts
tr y
tr an
Ġexp orts
Ġ4 5
get name
() );
fa ul
set dbconnection
Ġctdb entityquery
ctdb entityquery
ctdb exception
ĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠ
ad d
faul t
" ))
d i
e verity
l b
o k
p li
s up
w it
Ġ userid
ĠĠĠĠ ĠĠĠĠĠĠ
de fault
Ġc ase
in st
in itialize
Ġs paces
Ġs everity
01 2
an ce
Ġ2 6
ol ation
ot her
tran s
pli ed
sup plied
wit ch
inst ance
" ;
0 9
= >
d it
g l
g n
o re
s uccessful
Ġ -
Ġ >
Ġ }
Ġ public
ĠĠĠĠ Ġ
re d
00 5
Ġs uccessful
Ġ+ =>
error code
ob al
ĉĉĉĉ ĉĉčĊ
Ġimp orts
con dit
get subscript
get errorcode
Ġ3 0
ĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠ
Ġ5 0
Ġde si
si gn
equal sign
add condit
gl obal
ore case
Ġdesi red
equalsign orecase
addcondit ion
" :
2 0
4 0
5 1
= ",
i er
m it
m ax
o per
s witch
ent if
er ver
re ct
Ġm ax
ex p
in val
Ġs erver
ch ild
id entif
Ġp rotected
Ġp search
to tal
Ġto tal
Ġ2 3
or ity
auth ority
authoriz ed
se verity
un authorized
get max
Ġ< =
() )
11 10
11 20
equal s
im um
di rect
012 1
ier s
mit ted
oper ation
inval id
identif iers
getmax imum
direct ion
c yyy
f et
i st
n ull
s end
Ġ g
Ġ čĊ
Ġ reference
Ġ context
er e
Ġi s
al read
Ġs end
ch entity
st at
Ġ2 2
Ġn ot
ial ect
coolgen global
Ġ4 0
Ġwh ere
ct coolgenglobal
val ue
fet chentity
alread y
1 5
a ge
c d
c parent
c instance
f ull
h il
i qu
l y
n um
p search
p other
s s
s paces
t x
u s
w hil
Ġ 0
Ġ b
Ġ on
Ġ type
00 7
00 8
00 9
de s
Ġc parent
Ġc instance
Ġs tring
Ġ= =
01 31
01 51
Ġ1 1
Ġp other
02 11
Ġ2 4
Ġ2 5
group ent
group entity
un iqu
get groupentity
Ġ3 1
Ġ3 5
ĠĠĠĠĠĠĠĠ Ġ
() +
ĉĉĉĉĉ ĠĠĠĠĠĠĠ
Ġ5 5
break exception
Ġ9 3
-- --
stat us
15 0
ss age
whil e
Ġon ly
uniqu e
0 3
0 41
1 01
1 41
1 31
8 31
9 001
9 05
9 041
9 141
9 831
a c
b ac
c mp
c pt
d f
d l
d ialect
f m
h n
i olation
l t
l ect
m v
n g
n t
s tr
v iolation
Ġ list
Ġ roll
Ġ and
Ġ found
Ġ authority
er mitted
on e
loc ate
al ue
ex ist
ex cpt
ĉĉĉ Ġ
Ġv alue
Ġ1 6
Ġ1 7
Ġ1 01
Ġp ermitted
ĉĉĉĉ Ġ
Ġvi olation
se lect
Ġ" =",
Ġ3 2
Ġ3 3
ĉĉĉĉĉ ĠĠĠ
Ġmove member
Ġ5 3
Ġ5 6
Ġ9 6
ĉĉĉĉĉĉ ĠĠĠ
per mitted
Ġ> =
905 1
bac k
cmp nt
df lt
dl ng
fm t
hn dlng
Ġroll back
excpt n
) );
< =",
a ch
a pe
c at
c reference
c key
c create
d o
d er
e sc
e ssage
e ach
f i
g in
h ro
i se
l e
n ex
o pt
p reference
p update
r b
r ent
r codes
r un
s um
t her
t im
t hro
v id
w ise
| |
Ġ li
Ġ tr
Ġ error
Ġ text
Ġ ur
Ġ or
Ġ ori
Ġ filter
Ġ break
Ġ read
Ġ already
Ġ unique
Ġ each
Ġ tim
Ġ ||
Ġ! =
ĠĠĠĠĠĠ čĊ
re pe
Ġi f
Ġm essage
Ġc ur
Ġc reference
Ġc key
Ġc update
Ġc create
li ent
in d
in ser
in di
Ġs or
Ġs witch
Ġex it
Ġex ist
et ime
01 0
01 3
01 5
01 6
01 7
01 8
01 9
Ġ1 9
Ġp reference
Ġp update
st d
sc end
02 0
02 2
02 7
02 8
tex it
Ġ2 0
Ġ( !
ĉĉĉĉ ĉĉĉ
ate timestamp
Ġd ialect
Ġd rcodes
Ġd atetimestamp
or der
ser vid
Ġct breakexception
Ġ4 7
Ġst d
se texit
Ġctcoolgen global
Ġ" <=",
me ssage
Ġ3 4
Ġ3 6
Ġ3 8
eck sum
Ġo ther
ct breakexception
Ġ< ----
unt il
el d
Ġde scend
Ġ9 4
Ġ9 5
Ġ9 9
Ġch ecksum
not unique
ĠĠĠĠĠĠĠĠĠĠĠĠ Ġ
im ize
add order
identifiers get
Ġis olation
Ġb e
Ġb y
03 51
cat or
esc ape
fi eld
nex t
opt imize
thro w
Ġli ke
Ġtr ue
Ġori gin
Ġtim etime
repe at
Ġcur rent
inser t
indi cator
Ġsor ted
Ġexist s
Ġother wise
Ġ<---- --
Ġdescend ing
addorder field
Ġtimetime stamp
