{"<s>":0,"<pad>":1,"</s>":2,"<unk>":3,"<mask>":4,"!":5,"\"":6,"#":7,"$":8,"%":9,"&":10,"'":11,"(":12,")":13,"*":14,"+":15,",":16,"-":17,".":18,"/":19,"0":20,"1":21,"2":22,"3":23,"4":24,"5":25,"6":26,"7":27,"8":28,"9":29,":":30,";":31,"<":32,"=":33,">":34,"?":35,"@":36,"A":37,"B":38,"C":39,"D":40,"E":41,"F":42,"G":43,"H":44,"I":45,"J":46,"K":47,"L":48,"M":49,"N":50,"O":51,"P":52,"Q":53,"R":54,"S":55,"T":56,"U":57,"V":58,"W":59,"X":60,"Y":61,"Z":62,"[":63,"\\":64,"]":65,"^":66,"_":67,"`":68,"a":69,"b":70,"c":71,"d":72,"e":73,"f":74,"g":75,"h":76,"i":77,"j":78,"k":79,"l":80,"m":81,"n":82,"o":83,"p":84,"q":85,"r":86,"s":87,"t":88,"u":89,"v":90,"w":91,"x":92,"y":93,"z":94,"{":95,"|":96,"}":97,"~":98,"¡":99,"¢":100,"£":101,"¤":102,"¥":103,"¦":104,"§":105,"¨":106,"©":107,"ª":108,"«":109,"¬":110,"®":111,"¯":112,"°":113,"±":114,"²":115,"³":116,"´":117,"µ":118,"¶":119,"·":120,"¸":121,"¹":122,"º":123,"»":124,"¼":125,"½":126,"¾":127,"¿":128,"À":129,"Á":130,"Â":131,"Ã":132,"Ä":133,"Å":134,"Æ":135,"Ç":136,"È":137,"É":138,"Ê":139,"Ë":140,"Ì":141,"Í":142,"Î":143,"Ï":144,"Ð":145,"Ñ":146,"Ò":147,"Ó":148,"Ô":149,"Õ":150,"Ö":151,"×":152,"Ø":153,"Ù":154,"Ú":155,"Û":156,"Ü":157,"Ý":158,"Þ":159,"ß":160,"à":161,"á":162,"â":163,"ã":164,"ä":165,"å":166,"æ":167,"ç":168,"è":169,"é":170,"ê":171,"ë":172,"ì":173,"í":174,"î":175,"ï":176,"ð":177,"ñ":178,"ò":179,"ó":180,"ô":181,"õ":182,"ö":183,"÷":184,"ø":185,"ù":186,"ú":187,"û":188,"ü":189,"ý":190,"þ":191,"ÿ":192,"Ā":193,"ā":194,"Ă":195,"ă":196,"Ą":197,"ą":198,"Ć":199,"ć":200,"Ĉ":201,"ĉ":202,"Ċ":203,"ċ":204,"Č":205,"č":206,"Ď":207,"ď":208,"Đ":209,"đ":210,"Ē":211,"ē":212,"Ĕ":213,"ĕ":214,"Ė":215,"ė":216,"Ę":217,"ę":218,"Ě":219,"ě":220,"Ĝ":221,"ĝ":222,"Ğ":223,"ğ":224,"Ġ":225,"ġ":226,"Ģ":227,"ģ":228,"Ĥ":229,"ĥ":230,"Ħ":231,"ħ":232,"Ĩ":233,"ĩ":234,"Ī":235,"ī":236,"Ĭ":237,"ĭ":238,"Į":239,"į":240,"İ":241,"ı":242,"Ĳ":243,"ĳ":244,"Ĵ":245,"ĵ":246,"Ķ":247,"ķ":248,"ĸ":249,"Ĺ":250,"ĺ":251,"Ļ":252,"ļ":253,"Ľ":254,"ľ":255,"Ŀ":256,"ŀ":257,"Ł":258,"ł":259,"Ń":260,"ĠĠ":261,"čĊ":262,"ĠĠĠĠ":263,"en":264,"ĉĉ":265,"Ġ!":266,"ent":267,"er":268,"ut":269,"co":270,"on":271,"it":272,"oc":273,"ĠĠĠĠĠĠ":274,"re":275,"Ġi":276,"yy":277,"te":278,"loc":279,"al":280,"00":281,"ro":282,"ity":283,"Ġm":284,"entity":285,"de":286,"ĠĠĠ":287,"Ġc":288,"mp":289,"li":290,"put":291,"local":292,"localentity":293,"ex":294,"in":295,"Ġs":296,"Ġ+":297,"ec":298,"Ġ{":299,"ri":300,"tr":301,"Ġex":302,"..":303,"ub":304,"at":305,"Ġ=":306,"out":307,"Ġ+-":308,"ch":309,"comp":310,"onent":311,"Ġiyy":312,"component":313,"id":314,"ver":315,"code":316,"as":317,"ĉĉĉ":318,"pub":319,"lic":320,"public":321,"Ġv":322,"output":323,"et":324,");":325,"01":326,"ion":327,"Ġ1":328,"Ġp":329,"001":330,"erro":331,"error":332,"st":333,"to":334,"ob":335,"ect":336,"an":337,"Ġloc":338,"obj":339,"Ġto":340,"002":341,"sc":342,"02":343,"ew":344,"ar":345,"tex":346,"text":347,"Ġin":348,"ain":349,"train":350,"ce":351,"oid":352,"over":353,"up":354,"Ġ2":355,"ride":356,"...":357,"Ġvoid":358,"object":359,"override":360,"Ġexp":361,"ur":362,"list":363,"Ġ(":364,"ĉĉĉĉ":365,"07":366,"Ġcyy":367,"arent":368,"tur":369,"retur":370,"Ġ+--":371,"return":372,"ate":373,"ted":374,"qu":375,"Ġd":376,"Ġ+->":377,"ge":378,"or":379,"pt":380,"cted":381,"tected":382,"rotected":383,"Ġset":384,"ont":385,"chan":386,"change":387,"Ġ15":388,"ed":389,"outputs":390,"protected":391,"ser":392,"codes":393,"il":394,"Ġn":395,"Ġct":396,"ation":397,"aut":398,"ery":399,"query":400,"auth":401,"db":402,"gro":403,"group":404,"ori":405,"ĉĉčĊ":406,"Ġimp":407,"Ġw":408,"authori":409,"authoriz":410,"iyy":411,"ol":412,"();":413,"ial":414,"end":415,"attr":416,"Ġdont":417,"if":418,"con":419,"authorization":420,"iz":421,"las":422,"puts":423,"011":424,"ize":425,"lass":426,"ute":427,"ecute":428,"itial":429,"itialize":430,"gen":431,"cool":432,"Ġnew":433,"coolgen":434,"Ġparent":435,"Ġ4":436,"Ġst":437,"05":438,"Ġvi":439,"023":440,"Ġstate":441,"ment":442,"se":443,"un":444,"Ġctcoolgen":445,"ments":446,"2023":447,"roc":448,"ure":449,"ĉčĊ":450,"Ġ\"":451,"Ġ07":452,"Ġclass":453,"Ġproc":454,"Ġinputs":455,"Ġ+---":456,"edure":457,"Ġstatements":458,"Ġprocedure":459,"tend":460,"Ġoutputs":461,"core":462,"reas":463,"Ġexecute":464,"Ġextend":465,"Ġinitialize":466,"Ġview":467,"Ġctcoolgencore":468,"reason":469,"Ġextends":470,"fer":471,"ence":472,"refer":473,"reference":474,"me":475,"Ġisc":476,"server":477,"ke":478,"fo":479,"ov":480,"key":481,"ove":482,"ort":483,"ption":484,"get":485,"ll":486,"parent":487,"ĠĠĠĠĠĠĠ":488,"rea":489,"ript":490,"ubsc":491,"ubscript":492,"003":493,"ata":494,"Ġwh":495,"data":496,"rd":497,"cord":498,"record":499,"context":500,"Ġ3":501,"eck":502,"fil":503,"ter":504,"ĠĠĠĠĠĠĠĠ":505,"filter":506,"putentity":507,"inputentity":508,"Ġ+>":509,"check":510,"ase":511,"Ġo":512,"ct":513,"];":514,"Ġ<":515,"roll":516,"ork":517,"Ġwork":518,"Ġof":519,"()":520,"user":521,"ĉĉĉĉĉ":522,"Ġ27":523,"ot":524,"info":525,"ces":526,"case":527,"fa":528,"ĉĉĉčĊ":529,"ĉĉĉĉčĊ":530,"11":531,"option":532,"pkey":533,"set":534,"004":535,"and":536,"authorizationcheck":537,"unt":538,"ul":539,"Ġreturn":540,"yyy":541,"Ġmove":542,"Ġ46":543,"am":544,"ount":545,"Ġ5":546,"Ġgroup":547,"Ġctdb":548,"amount":549,"08":550,"date":551,"el":552,"081":553,"ber":554,"brea":555,"mber":556,"member":557,"break":558,"mm":559,"move":560,"subscript":561,"Ġde":562,"comm":563,"Ġsubscript":564,"update":565,"ild":566,"else":567,"command":568,"\",":569,"dont":570,"nect":571,"pe":572,"entityquery":573,"Ġdyyy":574,"dbcon":575,"read":576,"ctdb":577,"nection":578,"dbconnection":579,"fro":580,"imp":581,"ing":582,"Ġwhen":583,"movemember":584,"from":585,"ime":586,"exce":587,"Ġ29":588,"orts":589,"fail":590,"exception":591,"ich":592,"ms":593,"si":594,"Ġ9":595,"Ġfrom":596,"Ġch":597,"tring":598,"und":599,"found":600,"Ġwhich":601,"userid":602,"msg":603,"41":604,"amp":605,"cces":606,"ful":607,"not":608,"sful":609,"ty":610,"time":611,"ucces":612,"Ġquery":613,"verity":614,"asc":615,"Ġpkey":616,"stamp":617,"Ġ28":618,"failed":619,"type":620,"uccessful":621,"))":622,"10":623,"croll":624,"equ":625,"Ġscroll":626,"scroll":627,"dberror":628,"Ġ49":629,"Ġctdbquery":630,"Ġchild":631,"equal":632,"(\"":633,"ax":634,"aces":635,"cre":636,"ger":637,"paces":638,"sort":639,"tal":640,"um":641,"Ġentity":642,"teger":643,"integer":644,"Ġsort":645,"Ġ18":646,"Ġcyyy":647,"setsubscript":648,"timestamp":649,"create":650,"string":651,"val":652,"ĉĉĠ":653,"006":654,"Ġcat":655,"021":656,"Ġ21":657,"ĉĉĉĉĉĉ":658,"ĠĠĠĠĠĠĠĠĠĠĠĠ":659,"Ġcatch":660,"--":661,"31":662,"her":663,"im":664,"ue":665,"Ġreason":666,"Ġelse":667,"arch":668,"search":669,"ad":670,"ame":671,"class":672,"isc":673,"name":674,"per":675,"use":676,"ull":677,"Ġuse":678,"execute":679,"init":680,"inputs":681,"try":682,"tran":683,"Ġexports":684,"Ġ45":685,"getname":686,"());":687,"faul":688,"setdbconnection":689,"Ġctdbentityquery":690,"ctdbentityquery":691,"ctdbexception":692,"ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ":693,"add":694,"fault":695,"\"))":696,"di":697,"everity":698,"lb":699,"ok":700,"pli":701,"sup":702,"wit":703,"Ġuserid":704,"ĠĠĠĠĠĠĠĠĠĠ":705,"default":706,"Ġcase":707,"inst":708,"initialize":709,"Ġspaces":710,"Ġseverity":711,"012":712,"ance":713,"Ġ26":714,"olation":715,"other":716,"trans":717,"plied":718,"supplied":719,"witch":720,"instance":721,"\";":722,"09":723,"=>":724,"dit":725,"gl":726,"gn":727,"ore":728,"successful":729,"Ġ-":730,"Ġ>":731,"Ġ}":732,"Ġpublic":733,"ĠĠĠĠĠ":734,"red":735,"005":736,"Ġsuccessful":737,"Ġ+=>":738,"errorcode":739,"obal":740,"ĉĉĉĉĉĉčĊ":741,"Ġimports":742,"condit":743,"getsubscript":744,"geterrorcode":745,"Ġ30":746,"ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ":747,"Ġ50":748,"Ġdesi":749,"sign":750,"equalsign":751,"addcondit":752,"global":753,"orecase":754,"Ġdesired":755,"equalsignorecase":756,"addcondition":757,"\":":758,"20":759,"40":760,"51":761,"=\",":762,"ier":763,"mit":764,"max":765,"oper":766,"switch":767,"entif":768,"erver":769,"rect":770,"Ġmax":771,"exp":772,"inval":773,"Ġserver":774,"child":775,"identif":776,"Ġprotected":777,"Ġpsearch":778,"total":779,"Ġtotal":780,"Ġ23":781,"ority":782,"authority":783,"authorized":784,"severity":785,"unauthorized":786,"getmax":787,"Ġ<=":788,"())":789,"1110":790,"1120":791,"equals":792,"imum":793,"direct":794,"0121":795,"iers":796,"mitted":797,"operation":798,"invalid":799,"identifiers":800,"getmaximum":801,"direction":802,"cyyy":803,"fet":804,"ist":805,"null":806,"send":807,"Ġg":808,"ĠčĊ":809,"Ġreference":810,"Ġcontext":811,"ere":812,"Ġis":813,"alread":814,"Ġsend":815,"chentity":816,"stat":817,"Ġ22":818,"Ġnot":819,"ialect":820,"coolgenglobal":821,"Ġ40":822,"Ġwhere":823,"ctcoolgenglobal":824,"value":825,"fetchentity":826,"already":827,"15":828,"age":829,"cd":830,"cparent":831,"cinstance":832,"full":833,"hil":834,"iqu":835,"ly":836,"num":837,"psearch":838,"pother":839,"ss":840,"spaces":841,"tx":842,"us":843,"whil":844,"Ġ0":845,"Ġb":846,"Ġon":847,"Ġtype":848,"007":849,"008":850,"009":851,"des":852,"Ġcparent":853,"Ġcinstance":854,"Ġstring":855,"Ġ==":856,"0131":857,"0151":858,"Ġ11":859,"Ġpother":860,"0211":861,"Ġ24":862,"Ġ25":863,"groupent":864,"groupentity":865,"uniqu":866,"getgroupentity":867,"Ġ31":868,"Ġ35":869,"ĠĠĠĠĠĠĠĠĠ":870,"()+":871,"ĉĉĉĉĉĠĠĠĠĠĠĠ":872,"Ġ55":873,"breakexception":874,"Ġ93":875,"----":876,"status":877,"150":878,"ssage":879,"while":880,"Ġonly":881,"unique":882,"03":883,"041":884,"101":885,"141":886,"131":887,"831":888,"9001":889,"905":890,"9041":891,"9141":892,"9831":893,"ac":894,"bac":895,"cmp":896,"cpt":897,"df":898,"dl":899,"dialect":900,"fm":901,"hn":902,"iolation":903,"lt":904,"lect":905,"mv":906,"ng":907,"nt":908,"str":909,"violation":910,"Ġlist":911,"Ġroll":912,"Ġand":913,"Ġfound":914,"Ġauthority":915,"ermitted":916,"one":917,"locate":918,"alue":919,"exist":920,"excpt":921,"ĉĉĉĠ":922,"Ġvalue":923,"Ġ16":924,"Ġ17":925,"Ġ101":926,"Ġpermitted":927,"ĉĉĉĉĠ":928,"Ġviolation":929,"select":930,"Ġ\"=\",":931,"Ġ32":932,"Ġ33":933,"ĉĉĉĉĉĠĠĠ":934,"Ġmovemember":935,"Ġ53":936,"Ġ56":937,"Ġ96":938,"ĉĉĉĉĉĉĠĠĠ":939,"permitted":940,"Ġ>=":941,"9051":942,"back":943,"cmpnt":944,"dflt":945,"dlng":946,"fmt":947,"hndlng":948,"Ġrollback":949,"excptn":950,"));":951,"<=\",":952,"ach":953,"ape":954,"cat":955,"creference":956,"ckey":957,"ccreate":958,"do":959,"der":960,"esc":961,"essage":962,"each":963,"fi":964,"gin":965,"hro":966,"ise":967,"le":968,"nex":969,"opt":970,"preference":971,"pupdate":972,"rb":973,"rent":974,"rcodes":975,"run":976,"sum":977,"ther":978,"tim":979,"thro":980,"vid":981,"wise":982,"||":983,"Ġli":984,"Ġtr":985,"Ġerror":986,"Ġtext":987,"Ġur":988,"Ġor":989,"Ġori":990,"Ġfilter":991,"Ġbreak":992,"Ġread":993,"Ġalready":994,"Ġunique":995,"Ġeach":996,"Ġtim":997,"Ġ||":998,"Ġ!=":999,"ĠĠĠĠĠĠčĊ":1000,"repe":1001,"Ġif":1002,"Ġmessage":1003,"Ġcur":1004,"Ġcreference":1005,"Ġckey":1006,"Ġcupdate":1007,"Ġccreate":1008,"lient":1009,"ind":1010,"inser":1011,"indi":1012,"Ġsor":1013,"Ġswitch":1014,"Ġexit":1015,"Ġexist":1016,"etime":1017,"010":1018,"013":1019,"015":1020,"016":1021,"017":1022,"018":1023,"019":1024,"Ġ19":1025,"Ġpreference":1026,"Ġpupdate":1027,"std":1028,"scend":1029,"020":1030,"022":1031,"027":1032,"028":1033,"texit":1034,"Ġ20":1035,"Ġ(!":1036,"ĉĉĉĉĉĉĉ":1037,"atetimestamp":1038,"Ġdialect":1039,"Ġdrcodes":1040,"Ġdatetimestamp":1041,"order":1042,"servid":1043,"Ġctbreakexception":1044,"Ġ47":1045,"Ġstd":1046,"setexit":1047,"Ġctcoolgenglobal":1048,"Ġ\"<=\",":1049,"message":1050,"Ġ34":1051,"Ġ36":1052,"Ġ38":1053,"ecksum":1054,"Ġother":1055,"ctbreakexception":1056,"Ġ<----":1057,"until":1058,"eld":1059,"Ġdescend":1060,"Ġ94":1061,"Ġ95":1062,"Ġ99":1063,"Ġchecksum":1064,"notunique":1065,"ĠĠĠĠĠĠĠĠĠĠĠĠĠ":1066,"imize":1067,"addorder":1068,"identifiersget":1069,"Ġisolation":1070,"Ġbe":1071,"Ġby":1072,"0351":1073,"cator":1074,"escape":1075,"field":1076,"next":1077,"optimize":1078,"throw":1079,"Ġlike":1080,"Ġtrue":1081,"Ġorigin":1082,"Ġtimetime":1083,"repeat":1084,"Ġcurrent":1085,"insert":1086,"indicator":1087,"Ġsorted":1088,"Ġexists":1089,"Ġotherwise":1090,"Ġ<------":1091,"Ġdescending":1092,"addorderfield":1093,"Ġtimetimestamp":1094}