#version: 0.2
a t
e r
y y
o r
c o
n t
m p
r or
er ror
0 0
e nt
s t
o n
č Ċ
l o
e t
) ;
co mp
i yy
on ent
comp onent
l a
at a
d ata
error iyy
i n
lo c
t r
Ġ =
st at
d e
a l
g et
co de
00 00
i mp
e o
eo f
stat e
e x
u eof
v al
at tr
val ueof
( )
yy y
imp erroriyy
Ġ (
b data
g lo
glo bdata
in g
() .
r ing
st ring
9 0
c yyy
Ġ );
loc imperroriyy
w la
component r
s et
o a
a c
Ġ "
e d
u m
get state
getstate data
string attr
f i
i d
i t
u r
or t
4 1
90 41
ex p
loc erroriyy
m ent
la st
5 1
o u
s e
v er
n um
error data
et ur
etur n
l e
x ed
Ġ )
Ġ fi
xed stringattr
Ġfi xedstringattr
b er
e c
state ment
set last
num ber
statement number
i a
ac e
it y
setlast statementnumber
0000 0000
eturn code
component se
tr ace
exp erroriyy
ver ity
componentse verity
componentseverity code
m e
u nt
Ġ i
b le
d ou
e n
s er
dou ble
i on
c h
90 51
h ort
l l
s hort
componentr eturncode
c at
( );
2 0
d i
m s
ms g
a s
g in
i gin
v id
or igin
co nt
component origin
ex t
ser vid
cont ext
componentorigin servid
! =
Ġ !=
a r
nt attr
component context
Ġi ntattr
componentcontext string
i e
Ġ Ġ
get errordata
b ac
e as
o ll
on code
componentr eas
bac k
oll back
componentreas oncode
i f
error msg
errormsg iyy
i me
k s
r unt
Ġ 1
Ġ errordata
Ġ double
component ch
in di
componentr ollback
ec ks
cat or
runt ime
Ġdouble attr
componentch ecks
indi cator
componentrollback indicator
componentchecks um
a n
p ar
par m
c e
g en
r et
Ġ 8
Ġ trace
Ġ stringattr
51 2
a b
er ed
co unt
error en
Ġ) {
count ered
erroren countered
3 9
at ion
loc errormsgiyy
1 2
n d
); }
ou nd
2 20
2 39
ex it
20 239
ie f
220 20239
c yy
f ound
s a
u s
stat us
12 1
i fi
n o
runtime parm
ief runtimeparm
s sa
v ie
Ġ( (
ec t
me ssa
Ġi f
vie w
c d
c ur
r ent
s p
s w
t ion
Ġ <
Ġ n
Ġ in
st an
component messa
in stan
get x
set exit
set cur
00000000 1
00000000 3
rent ab
componentmessa getx
instan ce
setcur rentab
w oa
" ,
d o
g er
o k
r e
s q
Ġ '
Ġ čĊ
Ġ 512
nt ch
loc do
al ect
00000000 2
eturncode sq
di alect
ĠĠ Ġ
an ger
ntch anger
locdo ntchanger
locdontchanger eturncodesq
9 9
b l
t i
t y
w ia
} }
Ġ {
Ġ globdata
error found
ce p
ty p
( "
e st
m in
t er
u ll
| |
Ġ w
Ġ ||
00 22020239
comp ar
component imp
component sp
component dialect
ex cep
exp errormsgiyy
ment ation
le mentation
ec ifi
ser ver
ion id
cat ionid
errorencountered no
Ġn ull
min ation
ter mination
componentimp lementation
componentsp ecifi
componentdialect cd
errorencounteredno errorfound
componentimplementation id
componentspecifi cationid
) )
1 5
n on
r eturn
Ġ wla
Ġ ab
Ġ1 5
excep tion
non e
) (
a me
e l
e instance
f re
n ame
o id
q u
s iyy
t e
u te
v oid
ĉ Ġ
Ġ 0
Ġ f
Ġ }
Ġ cyyy
Ġ void
er siyy
ent ifi
get instance
ex ec
id entifi
exp identifi
(); }
setcurrentab id
setcurrentab name
Ġab exception
fre einstance
exec ute
expidentifi ersiyy
) .
f lo
h r
m bl
o w
o ver
r d
t hr
Ġ typ
Ġ= =
get errorencountered
get status
get view
set errorencountered
last status
se mbl
as sembl
);} }}
ti rd
flo w
over flow
thr ow
Ġtyp eof
getview overflow
assembl y
) );
b loc
d return
e w
e exit
f o
i c
n est
p u
r ollback
u se
v ity
v el
Ġ e
Ġ imp
Ġ ex
Ġ exp
Ġ sp
Ġ compar
st dreturn
et o
component ac
in fo
de c
ing le
set rollback
ac tion
ace s
00000000 0
msg typ
Ġ< =
Ġn ew
setexit state
setexit info
setexit msgtyp
000000001 1
000000001 9
re qu
99 99
bl ic
ti vity
est ed
compar eto
bloc k
nest ingle
pu blic
use action
Ġimp ort
Ġexp ort
Ġsp aces
Ġcompar eexit
componentac tivity
setrollback requ
setexitinfo msg
setexitmsgtyp e
nestingle vel
useaction block
componentactivity cd
setrollbackrequ ested
" ));
; }
u n
tr y
Ġ); }}
Ġ) );
cat ch
status none
! (
& &
( (
+ (
+ +(
- (
- -(
4 2
a la
b j
b statementnumber
e p
e s
e qu
f la
f un
i v
i nt
i runtime
l loc
m t
o bj
p r
p st
r b
r ound
s f
s u
v ed
Ġ 2
Ġ 5
Ġ _
Ġ last
Ġ ĉĠ
Ġ tird
Ġ &&
Ġ --(
Ġ obj
at e
00 1
00 2
st mt
in it
loc ation
loc ala
al s
al se
al location
get laststatus
imp dialect
() {
Ġ); }
Ġ) ))
setlast su
00000000 20
00000000 39
00000000 12
00000000 42
ĠĠ ĠĠ
ĠĠ ĠĠĠ
sa ved
Ġ(( !(
000000001 3
000000001 6
000000003 0
000000003 1
000000003 2
000000003 4
000000003 5
000000003 7
000000002 1
000000002 4
000000002 5
000000002 6
000000002 7
el se
Ġf alse
geterrorencountered sw
seterrorencountered sw
getviewoverflow sw
stdreturn rb
000000000 5
000000000 8
ep context
es c
equ als
fla g
fun c
iv ate
iruntime pst
pr ivate
Ġobj ect
locala lloc
impdialect iyy
setlastsu bstatementnumber
iruntimepst epcontext
