#version: 0.2
Ġ Ġ
ĠĠ ĠĠ
a t
e r
y y
o r
n t
0 0
c o
s t
e t
ĠĠĠĠ Ġ
r or
er ror
) ;
e x
o n
d at
dat a
e nt
m p
l o
i n
o a
ĠĠ Ġ
Ġ =
t r
co mp
on ent
comp onent
i yy
c yy
a l
ex p
l a
00 00
at tr
st at
Ġ w
g et
e o
eo f
error iyy
v al
Ġ (
val u
valu eof
( )
d e
lo c
ĠĠĠĠ ĠĠĠ
cyy y
stat e
c e
Ġ f
e n
Ġ "
b data
g lo
glo bdata
co de
() .
in g
o u
r ing
st ring
Ġ i
h or
ex t
s c
Ġ );
e d
2 1
exp erroriyy
i a
Ġ globdata
i d
s et
i sc
u m
r e
t y
string attr
u t
ĠĠĠĠ ĠĠĠĠ
get state
getstate data
error data
nt ext
co ntext
t i
v er
m e
s er
hor i
ut hori
c h
a n
i x
Ġf ix
ed stringattr
Ġfix edstringattr
Ġ }
Ġ {
u r
Ġ )
i mp
u nt
n um
r et
la st
s e
0000 0000
set last
m ent
state ment
b er
ĠĠĠĠ ĠĠĠĠĠ
num ber
statement number
3 1
r ou
2 0
a r
Ġ cyyy
or t
c k
setlast statementnumber
Ġw oa
b l
i on
p ar
Ġi f
( );
g en
yy y
ur n
at ion
loc erroriyy
a ce
tr ace
g rou
grou p
d i
a uthori
urn code
authori z
l l
! =
Ġ !=
a s
s hor
shor t
u s
stat us
4 1
in f
nt attr
Ġi ntattr
0 21
ation inf
authoriz ationinf
get errordata
r o
n d
Ġ errordata
Ġw la
group context
1 21
loc groupcontext
st an
in stan
instan ce
1 5
f er
en ce
re fer
refer ence
a b
ser ver
i me
component ret
componentret urncode
00 1
er ed
co unt
error en
count ered
erroren countered
ti r
i e
r unt
runt ime
on code
as oncode
par m
tir d
d ou
i ty
bl e
dou ble
p s
component context
component se
ver ity
componentcontext string
componentse verity
componentseverity code
exp isc
oa uthori
ty p
authorizationinf oauthori
authorizationinfoauthori ty
component re
componentre asoncode
f ou
fou nd
1 41
9 8
c at
error isc
98 31
t ext
Ġ 0
5 1
f runtime
fruntime parm
i g
ro ll
Ġ n
v id
or ig
in ser
component orig
inser vid
componentorig inservid
n o
b a
de c
Ġ 1
roll ba
rollba ck
s w
e ck
s um
in di
component ch
component rollback
cat or
eck sum
indi cator
componentch ecksum
componentrollback indicator
i l
9 141
ti on
authorizationinfoauthority status
ĠĠĠĠ ĠĠ
ĠĠĠĠ ĠĠĠĠĠĠĠ
0 2
e c
reference iyy
server data
Ġ 8
ti me
00 2
m a
n on
non e
Ġ trace
d o
nt ch
do ntch
dontch an
il d
c ur
r ent
set cur
rent ab
setcur rentab
w la
ĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠ
ch ild
t h
attr text
par ent
1 1
20 20
i nt
Ġ cyy
u ll
0 3
l i
" ,
) )
Ġ" ;
| |
Ġ ||
Ġn ull
1 31
parent p
) );
Ġ ab
Ġ stringattr
51 2
a mp
st amp
ie fruntimeparm
get instance
p tion
9 7
Ġ( (
) (
error found
ex ce
exce ption
a di
adi m
imp erroriyy
20 97
typ et
9 001
v ie
vie w
Ġ <
reference id
li st
e instance
f re
fre einstance
loc errorisc
15 0
errorencountered no
Ġab exception
errorencounteredno errorfound
e y
g er
loc dontchan
locdontchan ger
time stamp
( (
Ġ double
Ġdouble attr
( "
ex ec
ut e
exec ute
Ġi sc
Ġ tird
rou nd
ro w
th row
a me
n ame
serverdata server
imp isc
i t
č Ċ
m bl
ser id
se mbl
as sembl
assembl y
al l
dat e
002 2020
child c
u n
) .
o id
v oid
Ġ typ
Ġ void
Ġtyp eof
w ia
2097 2
exp all
o ver
e fruntimeparm
Ġi efruntimeparm
Ġ timestamp
Ġtimestamp attr
m m
exp referenceiyy
o k
comp a
i c
co mm
an d
comm and
setcurrentab id
setcurrentab name
k ey
key attrtext
et urncode
locdontchanger eturncode
locdontchangereturncode s
p u
Ġ 5
set errorencountered
bl ic
pu blic
Ġn e
loc referenceiyy
ec t
Ġ= =
f lo
view over
flo w
viewover flow
1 0
u serid
get status
get errorencountered
get viewoverflow
02 21
Ġ< =
Ġ throw
Ġne w
03 21
c tion
0 15
instance id
authorizationinf o
a ction
b loc
u se
action bloc
use actionbloc
useactionbloc k
Ġ 512
0 121
m s
ms g
Ġ) );
" ));
e l
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
015 1
9 0
msg iyy
g context
Ġ in
get ext
serverdata referenceid
dontchan getext
gcontext dontchangetext
gcontextdontchangetext text
0000 00
00000000 3
th er
000000 0
0 31
2 2020
Ġ short
Ġ +
exp errorisc
imp errorisc
Ġ 9
parentp keyattrtext
Ġ 15
e sc
f la
Ġ locgroupcontext
al se
Ġf un
Ġf alse
fla g
Ġfun c
2 5
ex it
imp f
locdontchangereturncodes q
loc imperroriyy
00000000 5
9 9
7 3
l e
d c
imp typet
& &
Ġ &&
02 51
" ;
s a
+ (
o ther
t er
Ġ compa
loc gcontextdontchangetexttext
re exit
ret o
compa reto
Ġ+ +(
Ġcompa reexit
00000000 4
a in
ĠĠĠĠĠĠĠĠ ĠĠ
ma int
maint ain
" )
b statementnumber
s u
w oa
component s
ch attrtext
se ar
00000000 6
setlast su
sear chattrtext
setlastsu bstatementnumber
1 73
serverdataserver time
serverdataserver date
Ġ >
g list
exp glist
status none
il ter
expall typet
impf ilter
b j
o bj
t ok
en id
seterrorencountered sw
authorizationinfo tok
obj ect
authorizationinfotok enid
g v
r gv
rgv c
d command
en dcommand
imp command
00000000 2
components endcommand
impcommand iyy
ret urn
q u
al ect
di alect
03 31
al loc
90 41
031 1
s sa
Ġ ;
me ssa
! (
0 131
3 9
e qu
s f
al s
Ġf or
Ġ) ))
02 31
Ġ(( !(
locdontchangereturncodes n
geterrorencountered sw
getviewoverflow sw
equ als
in it
0 11
Ġ el
00 20972
021 1
Ġel se
3 2
throw s
exp group
exp msgiyy
02 41
expgroup list
0 141
a u
f au
l t
error msgiyy
component messa
get x
de fau
imp childc
00000000 0000
00000000 000000000000
03 41
componentmessa getx
defau lt
0 6
ĠĠĠĠĠĠĠĠ ĠĠĠĠ
e asoncode
o p
s q
v el
at e
st ing
attr num
ck ey
child ckey
locdontchanger easoncode
le vel
sting level
childckey attrnum
locdontchangereasoncode sq
00000000 7
last status
11 10
o d
Ġ adim
exp ort
authorizationinfoauthoritystatus u
serverdata userid
1 8
Ġ return
0 7
tr an
exp t
typ e
authorizationinfoauthoritystatus r
expall childc
tran s
Ġ 150
3 4
in d
ou serid
21 9
context iyy
imp parentp
authorizationinf ouserid
authorizationinfoauthority ind
authorizationinfoauthoritystatus d
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
0000000 10
other attr
0 51
Ġ e
c d
er ation
exp typet
Ġi mp
ed op
authoriz edop
authorizationinfoauthoritystatus l
un authorizedop
impfilter iyy
object id
unauthorizedop eration
1 39
Ġ .
serverdataserver timestamp
other attrtext
34 5
Ġ time
Ġ date
90 51
07 1
Ġtime attr
Ġdate attr
e stinglevel
n estinglevel
Ġ _
Ġ 00000000
Ġ export
component dialect
exp errormsgiyy
00000000 8
11 20
99 99
componentdialect cd
c re
p date
u pdate
imp referenceiyy
00000000 1
expall parentp
0000000 11
173 0151
cre ate
] ,
m en
al alloc
loc alalloc
group trans
ime stamp
ie f
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠ
Ġab name
25 8
alloc ation
18 4
Ġimp ort
men u
0 41
011 1
06 1
c li
Ġ 20
ent userid
exp childc
get cli
() ,
imp dialect
0022020 219
10 6
expglist parentp
32 8
getcli entuserid
impdialect iyy
Ġ 2
Ġw ia
k ing
m od
s ion
u le
w or
loc contextiyy
Ġ" ";
imp gcontextdontchangetexttext
authorizationinf over
authorizationinfoauthority objectid
it num
un itnum
authorizationinfo mod
authorizationinfo wor
update userid
create userid
king unitnum
ule id
authorizationinfover sion
authorizationinfomod uleid
authorizationinfowor kingunitnum
Ġ tr
Ġ cat
0022020 139
Ġtr y
Ġcat ch
0022020 345
3 0
8 8
setlast status
2097 21
( -
co ther
st e
et imestamp
exp parentp
imp grouptrans
child cother
0000000 1
imptypet otherattr
expglist childc
impfilter st
childcother attrtext
2 3
a d
Ġ 4
m t
m ou
Ġ 25
in val
id command
imp childckeyattrnum
00000000 21
imptypet keyattrtext
impchildc parentpkeyattrtext
mou nt
inval idcommand
2 39
8 2
a y
t od
imp parentpkeyattrtext
errorencountered errorfound
typet keyattrtext
0022020 258
0022020 184
impf ro
000000002 7
tod ay
0 150
9 4
v ed
ĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠ
sa ved
173 0150
- (
- -(
2 4
2 8
h ild
i v
i runtime
p r
p context
p ste
Ġ last
Ġ object
Ġ --(
st mt
loc errormsgiyy
sc hild
re set
0022020 106
0022020 328
000000003 3
000000005 9
000000002 9
expt schild
iv ate
iruntime pste
pr ivate
exptschild c
iruntimepste pcontext
Ġ string
ĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠ
a p
c ation
f l
l s
p li
get laststatus
00000000 9
ation id
inf o
15 4
ma in
list sc
Ġne stinglevel
015 154
imptypet instanceid
000000004 4
173 015154
impchildc instanceid
laststatus ief
impparentp instanceid
allocation error
ap pli
laststatusief allocationerror
appli cation
5 6
n ull
p ad
Ġ tir
Ġ today
Ġ pad
0 4
1 9
5 3
a mount
i f
p et
y pet
Ġ 32
st ypet
exp contextiyy
valu e
ĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠ
imp groupcontext
00000000 41
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠ
000000003 0
000000003 7
000000005 7
000000004 7
000000006 9
expt stypet
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
1730151 94
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠ
1730150 82
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
0 1
0 9
2 2
f p
g trans
m etimestamp
s parentp
dat etimestamp
set exit
ty object
ĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠ
ti metimestamp
imp gtrans
00000000 25
ar t
authori tyobject
childc parentpkeyattrtext
20972 8
000000003 5
000000003 6
22020 219
22020 139
22020 345
22020 258
22020 184
22020 106
22020 328
000000005 2
000000004 6
expalltypet otherattr
000000002 6
expt sparentp
000000001 9
impfilterst op
impfilterst art
impfro m
24 0
info objectid
Ġpad view
impgtrans isc
authorityobject infoobjectid
2097 30
0 5
1 6
] );
Ġ '
0022020 239
20972 88
000000003 8
22020 239
000000005 8
000000006 0
000000006 3
expalltypet referenceid
expalltypet instanceid
000000002 4
expallchildc referenceid
expallchildc instanceid
000000010 9
000000001 3
exptschildc referenceid
Ġtoday st
f at
g e
Ġ exception
Ġ execute
error messa
in all
al error
exp ect
get last
Ġf inall
ed exception
set status
set errormessa
Ġ) .
00000000 00
un expect
000000007 4
000000007 5
laststatus fat
laststatus unexpect
000000008 0
9999 99
9999 999999
getlast statementnumber
Ġfinall y
edexception error
seterrormessa ge
laststatusfat alerror
laststatusunexpect edexceptionerror
" );
0 8
2 7
2 9
6 3
8 3
b y
d er
d num
f ie
i m
l la
l dnum
m in
o ption
p ec
s ort
Ġ get
Ġ expgrouplist
Ġ 30
or der
00 209721
ent p
mp ar
component imp
al attr
exp parentpkeyattrtext
re ction
re ad
imp childcotherattrtext
00000000 97
00000000 10
00000000 18
ment ationid
di rection
ro lla
roll type
dec im
list list
list sort
list order
20972 5
20972 9
20972 28
ic ationid
000000003 2
000000003 4
000000003 9
22020 240
000000005 0
000000005 3
000000005 4
le mentationid
imptypet referenceid
imptypet searchattrtext
imptypet otherattrtext
ter min
000000004 2
000000004 8
000000004 9
components pec
expalltypet keyattrtext
expalltypet searchattrtext
expalltypet otherattrtext
expalltypet updateuserid
expalltypet createuserid
000000002 3
0020972 8
impchildc referenceid
impchildc searchattrtext
000000007 0
000000007 1
000000007 2
impparentp referenceid
000000010 1
000000010 4
000000010 8
exptypet referenceid
Ġimp grouptrans
000000011 3
000000011 8
1730151 83
expchildc referenceid
expparentp searchattrtext
imptypetotherattr time
imptypetotherattr date
imptypetotherattr amount
impfro mpar
exptschildc instanceid
listsc rolla
listsc rolltype
Ġtir dat
if icationid
exptstypet referenceid
by fie
Ġget type
componentimp lementationid
decim alattr
listlist direction
listsort option
listorder byfie
termin ation
componentspec ificationid
impfrompar entp
listscrolla mount
listorderbyfie ldnum
mp ty
00000000 73
1730151 23
exptsparentp referenceid
1 2
1 3
1 4
1 7
2 6
6 9
7 53
i er
l et
s y
s iyy
s date
00 6
00 8
ent if
tr ce
exp id
get sy
() );
de let
21 5
00000000 20
41 7
98 8
time value
97 7
2097 173
date value
expall childckeyattrnum
expall childcotherattrtext
90 4
000000005 5
000000005 6
99 1
000000004 3
000000006 1
000000006 2
000000006 4
000000006 5
000000006 6
000000006 7
000000006 8
expglist parentpkeyattrtext
expglist childckeyattrnum
expglist childcotherattrtext
0020972 5
0020972 9
export datetimestamp
export timetimestamp
expallchildc parentpkeyattrtext
expallchildc searchattrtext
expallchildc updateuserid
expallchildc createuserid
impparentp searchattrtext
impparentp otherattrtext
impparentp typetkeyattrtext
exptypet instanceid
exptypet otherattr
000000008 6
expallparentp referenceid
expallparentp instanceid
expallparentp typetkeyattrtext
000000011 2
expchildc instanceid
expglistparentp referenceid
expglistparentp instanceid
expglistparentp searchattrtext
expglistparentp otherattrtext
expglistparentp typetkeyattrtext
ste m
00000001 15
expglistchildc referenceid
expglistchildc instanceid
expglistchildc parentpkeyattrtext
expglistchildc searchattrtext
23 3
000000009 2
000000009 6
exptstypet instanceid
22 6
209730 73
69 1
ier siyy
entif iersiyy
expid entifiersiyy
getsy stem
delet e
2097173 5
exportdatetimestamp datevalue
exporttimetimestamp timevalue
/ /
h er
Ġ statement
Ġ //
Ġ her
000000007 6
Ġe mpty
000000008 1
1730151 88
expparentp referenceid
1730150 56
Ġtoday sdate
exptsparentp instanceid
Ġtodayst ime
Ġtodayst imestamp
Ġher e
4 6
4 56
6 6
7 9
7 66
9 3
a c
b ig
d return
e st
p ace
s pace
v ity
Ġ ex
Ġ decimalattr
Ġ big
Ġ space
st dreturn
component ac
exp childckeyattrnum
exp childcotherattrtext
loc imptypetkeyattrtext
loc impparentpkeyattrtext
set rollback
re qu
ĠĠĠĠĠĠĠĠ ĠĠĠĠĠ
ti vity
00000000 15
00000000 98
00000000 11
00000000 05
parentp searchattrtext
2097 16
0022020 240
childc instanceid
childc searchattrtext
20972 63
20972 753
20972 215
20972 417
20972 988
20972 977
20972 904
20972 991
20972 233
20972 226
20972 691
expall parentpkeyattrtext
msg type
0000000 131
Ġshort attr
000000004 5
impfilter parentpsearchattrtext
impfilter childcsearchattrtext
0020972 88
0020972 28
0020972 63
000000010 6
exptypet keyattrtext
exptypet searchattrtext
exptypet otherattrtext
exptypet updateuserid
exptypet createuserid
000000008 2
000000008 3
000000008 5
000000001 4
000000001 7
expallparentp searchattrtext
expallparentp otherattrtext
expallparentp updateuserid
expallparentp createuserid
000000011 1
000000011 6
expchildc parentpkeyattrtext
expchildc searchattrtext
expchildc updateuserid
expchildc createuserid
209721 15
209721 82
209721 04
209721 09
00000001 03
00000001 23
Ġ4 8
today st
info msg
Ġtir f
53 5
setexit state
setexit msgtype
setexit infomsg
209728 02
209728 06
expalltypetotherattr time
expalltypetotherattr date
expalltypetotherattr amount
impfilterstop parentpkeyattrtext
impfilterstop childckeyattrnum
impfilterstop childcparentpkeyattrtext
impfilterstart parentpkeyattrtext
impfilterstart childckeyattrnum
impfilterstart childcparentpkeyattrtext
impfrom childckeyattrnum
impfrom childcparentpkeyattrtext
impfrom childcinstanceid
209730 46
2097288 5
2097288 8
209729 19
2097228 0
2097228 6
impfromparentp keyattrtext
impfromparentp instanceid
est ed
Ġbig decimalattr
Ġspace s
componentac tivity
setrollback requ
209716 06
componentactivity cd
setrollbackrequ ested
d t
t s
t mt
set viewoverflow
tir trce
20972 39
expparentp instanceid
94 9
Ġtir trce
Ġpad text
datetimestamp oa
timetimestamp oa
todayst imestamp
dt ts
tmt s
3 03
4 4
6 4
d d
d f
e mpty
h h
p read
r b
s s
t f
Ġ 3
Ġ ba
yy yy
00 20973073
00 20971735
00 20973046
00 20971606
get default
loc imptypetinstanceid
loc impparentpinstanceid
loc empty
se attr
00000000 31
00000000 51
00000000 99
00000000 06
00000000 07
00000000 94
00000000 04
00000000 08
tir f
tir dat
2097 19
2097 303
20972 3
20972 56
20972 456
20972 766
20972 535
20972 949
mm dd
mm ss
000000 0121
000000004 0
Ġ> =
0020972 753
0020972 215
0020972 417
0020972 988
0020972 977
0020972 904
0020972 991
0020972 233
0020972 226
0020972 691
0020972 456
0020972 766
0020972 535
000000007 7
000000010 5
000000010 7
000000008 7
000000008 8
000000001 2
000000001 6
000000011 0
000000011 4
expparentp otherattrtext
expparentp updateuserid
expparentp createuserid
expparentp typetkeyattrtext
00000001 00
00000001 02
00000001 25
00000001 27
00000001 29
000000009 1
209728 90
209728 93
2097288 1
00209721 15
00209721 82
00209721 04
00209721 09
209725 21
209725 06
209725 34
209725 79
209729 56
209729 53
00209728 02
00209728 90
00209728 06
00209728 93
00209725 06
00209725 34
00209725 79
00209729 56
00209729 19
00209729 53
exptypetotherattr time
exptypetotherattr date
exptypetotherattr amount
getsystem time
getsystem timestamp
getsystem date
stdreturn rb
2097263 3
2097263 7
002097288 5
002097288 8
002097228 0
002097228 6
002097263 3
002097263 7
Ġtirf dtts
Ġtirf tmts
2097239 4
44 9
hh mmss
Ġba seattr
yyyy mmdd
getdefault value
locempty childckeyattrnum
209719 02
2097303 4
2097256 8
